#![doc = r" Generated types and constants from Postgres' header files necessary to represent"]
#![doc = r#" a parse tree as raw "C" structures.  Also contains various enum types used by"#]
#![doc = r" this module and the `nodes` module"]
#![allow(improper_ctypes)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]
use serde::{Deserialize, Serialize};
#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const ALLOCSET_DEFAULT_MINSIZE: u32 = 0;
pub const ALLOCSET_DEFAULT_INITSIZE: u32 = 8192;
pub const ALLOCSET_DEFAULT_MAXSIZE: u32 = 8388608;
pub type Oid = ::std::os::raw::c_uint;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type size_t = __darwin_size_t;
pub type int16 = ::std::os::raw::c_short;
pub type int32 = ::std::os::raw::c_int;
pub type uint32 = ::std::os::raw::c_uint;
pub type bits32 = uint32;
pub type uint64 = ::std::os::raw::c_ulong;
pub type Size = size_t;
pub type Index = ::std::os::raw::c_uint;
pub type sigjmp_buf = [::std::os::raw::c_int; 38usize];
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ErrorContextCallback {
    pub previous: *mut ErrorContextCallback,
    pub callback: ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>,
    pub arg: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ErrorContextCallback() {
    assert_eq!(
        ::std::mem::size_of::<ErrorContextCallback>(),
        24usize,
        concat!("Size of: ", stringify!(ErrorContextCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<ErrorContextCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(ErrorContextCallback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorContextCallback>())).previous as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorContextCallback),
            "::",
            stringify!(previous)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorContextCallback>())).callback as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorContextCallback),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorContextCallback>())).arg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorContextCallback),
            "::",
            stringify!(arg)
        )
    );
}
impl Default for ErrorContextCallback {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub static mut error_context_stack: *mut ErrorContextCallback;
}
extern "C" {
    pub static mut PG_exception_stack: *mut sigjmp_buf;
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ErrorData {
    pub elevel: ::std::os::raw::c_int,
    pub output_to_server: bool,
    pub output_to_client: bool,
    pub show_funcname: bool,
    pub hide_stmt: bool,
    pub hide_ctx: bool,
    pub filename: *const ::std::os::raw::c_char,
    pub lineno: ::std::os::raw::c_int,
    pub funcname: *const ::std::os::raw::c_char,
    pub domain: *const ::std::os::raw::c_char,
    pub context_domain: *const ::std::os::raw::c_char,
    pub sqlerrcode: ::std::os::raw::c_int,
    pub message: *mut ::std::os::raw::c_char,
    pub detail: *mut ::std::os::raw::c_char,
    pub detail_log: *mut ::std::os::raw::c_char,
    pub hint: *mut ::std::os::raw::c_char,
    pub context: *mut ::std::os::raw::c_char,
    pub message_id: *const ::std::os::raw::c_char,
    pub schema_name: *mut ::std::os::raw::c_char,
    pub table_name: *mut ::std::os::raw::c_char,
    pub column_name: *mut ::std::os::raw::c_char,
    pub datatype_name: *mut ::std::os::raw::c_char,
    pub constraint_name: *mut ::std::os::raw::c_char,
    pub cursorpos: ::std::os::raw::c_int,
    pub internalpos: ::std::os::raw::c_int,
    pub internalquery: *mut ::std::os::raw::c_char,
    pub saved_errno: ::std::os::raw::c_int,
    pub assoc_context: *mut MemoryContextData,
}
#[test]
fn bindgen_test_layout_ErrorData() {
    assert_eq!(
        ::std::mem::size_of::<ErrorData>(),
        184usize,
        concat!("Size of: ", stringify!(ErrorData))
    );
    assert_eq!(
        ::std::mem::align_of::<ErrorData>(),
        8usize,
        concat!("Alignment of ", stringify!(ErrorData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).elevel as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(elevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).output_to_server as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(output_to_server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).output_to_client as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(output_to_client)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).show_funcname as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(show_funcname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).hide_stmt as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(hide_stmt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).hide_ctx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(hide_ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).lineno as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).funcname as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(funcname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).domain as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).context_domain as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(context_domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).sqlerrcode as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(sqlerrcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).message as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).detail as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(detail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).detail_log as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(detail_log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).hint as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).context as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).message_id as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(message_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).schema_name as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(schema_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).table_name as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(table_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).column_name as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(column_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).datatype_name as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(datatype_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).constraint_name as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(constraint_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).cursorpos as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(cursorpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).internalpos as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(internalpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).internalquery as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(internalquery)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).saved_errno as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(saved_errno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ErrorData>())).assoc_context as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ErrorData),
            "::",
            stringify!(assoc_context)
        )
    );
}
impl Default for ErrorData {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn CopyErrorData() -> *mut ErrorData;
}
extern "C" {
    pub fn FreeErrorData(edata: *mut ErrorData);
}
extern "C" {
    pub fn FlushErrorState();
}
pub type MemoryContext = *mut MemoryContextData;
pub type MemoryContextCallbackFunction =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct MemoryContextCallback {
    pub func: MemoryContextCallbackFunction,
    pub arg: *mut ::std::os::raw::c_void,
    pub next: *mut MemoryContextCallback,
}
#[test]
fn bindgen_test_layout_MemoryContextCallback() {
    assert_eq!(
        ::std::mem::size_of::<MemoryContextCallback>(),
        24usize,
        concat!("Size of: ", stringify!(MemoryContextCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<MemoryContextCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(MemoryContextCallback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextCallback>())).func as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCallback),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextCallback>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCallback),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextCallback>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCallback),
            "::",
            stringify!(next)
        )
    );
}
impl Default for MemoryContextCallback {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub static mut CurrentMemoryContext: MemoryContext;
}
pub type Datum = usize;
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum pg_enc {
    PG_SQL_ASCII = 0,
    PG_EUC_JP = 1,
    PG_EUC_CN = 2,
    PG_EUC_KR = 3,
    PG_EUC_TW = 4,
    PG_EUC_JIS_2004 = 5,
    PG_UTF8 = 6,
    PG_MULE_INTERNAL = 7,
    PG_LATIN1 = 8,
    PG_LATIN2 = 9,
    PG_LATIN3 = 10,
    PG_LATIN4 = 11,
    PG_LATIN5 = 12,
    PG_LATIN6 = 13,
    PG_LATIN7 = 14,
    PG_LATIN8 = 15,
    PG_LATIN9 = 16,
    PG_LATIN10 = 17,
    PG_WIN1256 = 18,
    PG_WIN1258 = 19,
    PG_WIN866 = 20,
    PG_WIN874 = 21,
    PG_KOI8R = 22,
    PG_WIN1251 = 23,
    PG_WIN1252 = 24,
    PG_ISO_8859_5 = 25,
    PG_ISO_8859_6 = 26,
    PG_ISO_8859_7 = 27,
    PG_ISO_8859_8 = 28,
    PG_WIN1250 = 29,
    PG_WIN1253 = 30,
    PG_WIN1254 = 31,
    PG_WIN1255 = 32,
    PG_WIN1257 = 33,
    PG_KOI8U = 34,
    PG_SJIS = 35,
    PG_BIG5 = 36,
    PG_GBK = 37,
    PG_UHC = 38,
    PG_GB18030 = 39,
    PG_JOHAB = 40,
    PG_SHIFT_JIS_2004 = 41,
    _PG_LAST_ENCODING_ = 42,
}
extern "C" {
    pub fn SetDatabaseEncoding(encoding: ::std::os::raw::c_int);
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NodeTag {
    T_Invalid = 0,
    T_IndexInfo = 1,
    T_ExprContext = 2,
    T_ProjectionInfo = 3,
    T_JunkFilter = 4,
    T_OnConflictSetState = 5,
    T_ResultRelInfo = 6,
    T_EState = 7,
    T_TupleTableSlot = 8,
    T_Plan = 9,
    T_Result = 10,
    T_ProjectSet = 11,
    T_ModifyTable = 12,
    T_Append = 13,
    T_MergeAppend = 14,
    T_RecursiveUnion = 15,
    T_BitmapAnd = 16,
    T_BitmapOr = 17,
    T_Scan = 18,
    T_SeqScan = 19,
    T_SampleScan = 20,
    T_IndexScan = 21,
    T_IndexOnlyScan = 22,
    T_BitmapIndexScan = 23,
    T_BitmapHeapScan = 24,
    T_TidScan = 25,
    T_SubqueryScan = 26,
    T_FunctionScan = 27,
    T_ValuesScan = 28,
    T_TableFuncScan = 29,
    T_CteScan = 30,
    T_NamedTuplestoreScan = 31,
    T_WorkTableScan = 32,
    T_ForeignScan = 33,
    T_CustomScan = 34,
    T_Join = 35,
    T_NestLoop = 36,
    T_MergeJoin = 37,
    T_HashJoin = 38,
    T_Material = 39,
    T_Sort = 40,
    T_Group = 41,
    T_Agg = 42,
    T_WindowAgg = 43,
    T_Unique = 44,
    T_Gather = 45,
    T_GatherMerge = 46,
    T_Hash = 47,
    T_SetOp = 48,
    T_LockRows = 49,
    T_Limit = 50,
    T_NestLoopParam = 51,
    T_PlanRowMark = 52,
    T_PartitionPruneInfo = 53,
    T_PartitionedRelPruneInfo = 54,
    T_PartitionPruneStepOp = 55,
    T_PartitionPruneStepCombine = 56,
    T_PlanInvalItem = 57,
    T_PlanState = 58,
    T_ResultState = 59,
    T_ProjectSetState = 60,
    T_ModifyTableState = 61,
    T_AppendState = 62,
    T_MergeAppendState = 63,
    T_RecursiveUnionState = 64,
    T_BitmapAndState = 65,
    T_BitmapOrState = 66,
    T_ScanState = 67,
    T_SeqScanState = 68,
    T_SampleScanState = 69,
    T_IndexScanState = 70,
    T_IndexOnlyScanState = 71,
    T_BitmapIndexScanState = 72,
    T_BitmapHeapScanState = 73,
    T_TidScanState = 74,
    T_SubqueryScanState = 75,
    T_FunctionScanState = 76,
    T_TableFuncScanState = 77,
    T_ValuesScanState = 78,
    T_CteScanState = 79,
    T_NamedTuplestoreScanState = 80,
    T_WorkTableScanState = 81,
    T_ForeignScanState = 82,
    T_CustomScanState = 83,
    T_JoinState = 84,
    T_NestLoopState = 85,
    T_MergeJoinState = 86,
    T_HashJoinState = 87,
    T_MaterialState = 88,
    T_SortState = 89,
    T_GroupState = 90,
    T_AggState = 91,
    T_WindowAggState = 92,
    T_UniqueState = 93,
    T_GatherState = 94,
    T_GatherMergeState = 95,
    T_HashState = 96,
    T_SetOpState = 97,
    T_LockRowsState = 98,
    T_LimitState = 99,
    T_Alias = 100,
    T_RangeVar = 101,
    T_TableFunc = 102,
    T_Expr = 103,
    T_Var = 104,
    T_Const = 105,
    T_Param = 106,
    T_Aggref = 107,
    T_GroupingFunc = 108,
    T_WindowFunc = 109,
    T_SubscriptingRef = 110,
    T_FuncExpr = 111,
    T_NamedArgExpr = 112,
    T_OpExpr = 113,
    T_DistinctExpr = 114,
    T_NullIfExpr = 115,
    T_ScalarArrayOpExpr = 116,
    T_BoolExpr = 117,
    T_SubLink = 118,
    T_SubPlan = 119,
    T_AlternativeSubPlan = 120,
    T_FieldSelect = 121,
    T_FieldStore = 122,
    T_RelabelType = 123,
    T_CoerceViaIO = 124,
    T_ArrayCoerceExpr = 125,
    T_ConvertRowtypeExpr = 126,
    T_CollateExpr = 127,
    T_CaseExpr = 128,
    T_CaseWhen = 129,
    T_CaseTestExpr = 130,
    T_ArrayExpr = 131,
    T_RowExpr = 132,
    T_RowCompareExpr = 133,
    T_CoalesceExpr = 134,
    T_MinMaxExpr = 135,
    T_SQLValueFunction = 136,
    T_XmlExpr = 137,
    T_NullTest = 138,
    T_BooleanTest = 139,
    T_CoerceToDomain = 140,
    T_CoerceToDomainValue = 141,
    T_SetToDefault = 142,
    T_CurrentOfExpr = 143,
    T_NextValueExpr = 144,
    T_InferenceElem = 145,
    T_TargetEntry = 146,
    T_RangeTblRef = 147,
    T_JoinExpr = 148,
    T_FromExpr = 149,
    T_OnConflictExpr = 150,
    T_IntoClause = 151,
    T_ExprState = 152,
    T_AggrefExprState = 153,
    T_WindowFuncExprState = 154,
    T_SetExprState = 155,
    T_SubPlanState = 156,
    T_AlternativeSubPlanState = 157,
    T_DomainConstraintState = 158,
    T_PlannerInfo = 159,
    T_PlannerGlobal = 160,
    T_RelOptInfo = 161,
    T_IndexOptInfo = 162,
    T_ForeignKeyOptInfo = 163,
    T_ParamPathInfo = 164,
    T_Path = 165,
    T_IndexPath = 166,
    T_BitmapHeapPath = 167,
    T_BitmapAndPath = 168,
    T_BitmapOrPath = 169,
    T_TidPath = 170,
    T_SubqueryScanPath = 171,
    T_ForeignPath = 172,
    T_CustomPath = 173,
    T_NestPath = 174,
    T_MergePath = 175,
    T_HashPath = 176,
    T_AppendPath = 177,
    T_MergeAppendPath = 178,
    T_GroupResultPath = 179,
    T_MaterialPath = 180,
    T_UniquePath = 181,
    T_GatherPath = 182,
    T_GatherMergePath = 183,
    T_ProjectionPath = 184,
    T_ProjectSetPath = 185,
    T_SortPath = 186,
    T_GroupPath = 187,
    T_UpperUniquePath = 188,
    T_AggPath = 189,
    T_GroupingSetsPath = 190,
    T_MinMaxAggPath = 191,
    T_WindowAggPath = 192,
    T_SetOpPath = 193,
    T_RecursiveUnionPath = 194,
    T_LockRowsPath = 195,
    T_ModifyTablePath = 196,
    T_LimitPath = 197,
    T_EquivalenceClass = 198,
    T_EquivalenceMember = 199,
    T_PathKey = 200,
    T_PathTarget = 201,
    T_RestrictInfo = 202,
    T_IndexClause = 203,
    T_PlaceHolderVar = 204,
    T_SpecialJoinInfo = 205,
    T_AppendRelInfo = 206,
    T_PlaceHolderInfo = 207,
    T_MinMaxAggInfo = 208,
    T_PlannerParamItem = 209,
    T_RollupData = 210,
    T_GroupingSetData = 211,
    T_StatisticExtInfo = 212,
    T_MemoryContext = 213,
    T_AllocSetContext = 214,
    T_SlabContext = 215,
    T_GenerationContext = 216,
    T_Value = 217,
    T_Integer = 218,
    T_Float = 219,
    T_String = 220,
    T_BitString = 221,
    T_Null = 222,
    T_List = 223,
    T_IntList = 224,
    T_OidList = 225,
    T_ExtensibleNode = 226,
    T_RawStmt = 227,
    T_Query = 228,
    T_PlannedStmt = 229,
    T_InsertStmt = 230,
    T_DeleteStmt = 231,
    T_UpdateStmt = 232,
    T_SelectStmt = 233,
    T_AlterTableStmt = 234,
    T_AlterTableCmd = 235,
    T_AlterDomainStmt = 236,
    T_SetOperationStmt = 237,
    T_GrantStmt = 238,
    T_GrantRoleStmt = 239,
    T_AlterDefaultPrivilegesStmt = 240,
    T_ClosePortalStmt = 241,
    T_ClusterStmt = 242,
    T_CopyStmt = 243,
    T_CreateStmt = 244,
    T_DefineStmt = 245,
    T_DropStmt = 246,
    T_TruncateStmt = 247,
    T_CommentStmt = 248,
    T_FetchStmt = 249,
    T_IndexStmt = 250,
    T_CreateFunctionStmt = 251,
    T_AlterFunctionStmt = 252,
    T_DoStmt = 253,
    T_RenameStmt = 254,
    T_RuleStmt = 255,
    T_NotifyStmt = 256,
    T_ListenStmt = 257,
    T_UnlistenStmt = 258,
    T_TransactionStmt = 259,
    T_ViewStmt = 260,
    T_LoadStmt = 261,
    T_CreateDomainStmt = 262,
    T_CreatedbStmt = 263,
    T_DropdbStmt = 264,
    T_VacuumStmt = 265,
    T_ExplainStmt = 266,
    T_CreateTableAsStmt = 267,
    T_CreateSeqStmt = 268,
    T_AlterSeqStmt = 269,
    T_VariableSetStmt = 270,
    T_VariableShowStmt = 271,
    T_DiscardStmt = 272,
    T_CreateTrigStmt = 273,
    T_CreatePLangStmt = 274,
    T_CreateRoleStmt = 275,
    T_AlterRoleStmt = 276,
    T_DropRoleStmt = 277,
    T_LockStmt = 278,
    T_ConstraintsSetStmt = 279,
    T_ReindexStmt = 280,
    T_CheckPointStmt = 281,
    T_CreateSchemaStmt = 282,
    T_AlterDatabaseStmt = 283,
    T_AlterDatabaseSetStmt = 284,
    T_AlterRoleSetStmt = 285,
    T_CreateConversionStmt = 286,
    T_CreateCastStmt = 287,
    T_CreateOpClassStmt = 288,
    T_CreateOpFamilyStmt = 289,
    T_AlterOpFamilyStmt = 290,
    T_PrepareStmt = 291,
    T_ExecuteStmt = 292,
    T_DeallocateStmt = 293,
    T_DeclareCursorStmt = 294,
    T_CreateTableSpaceStmt = 295,
    T_DropTableSpaceStmt = 296,
    T_AlterObjectDependsStmt = 297,
    T_AlterObjectSchemaStmt = 298,
    T_AlterOwnerStmt = 299,
    T_AlterOperatorStmt = 300,
    T_DropOwnedStmt = 301,
    T_ReassignOwnedStmt = 302,
    T_CompositeTypeStmt = 303,
    T_CreateEnumStmt = 304,
    T_CreateRangeStmt = 305,
    T_AlterEnumStmt = 306,
    T_AlterTSDictionaryStmt = 307,
    T_AlterTSConfigurationStmt = 308,
    T_CreateFdwStmt = 309,
    T_AlterFdwStmt = 310,
    T_CreateForeignServerStmt = 311,
    T_AlterForeignServerStmt = 312,
    T_CreateUserMappingStmt = 313,
    T_AlterUserMappingStmt = 314,
    T_DropUserMappingStmt = 315,
    T_AlterTableSpaceOptionsStmt = 316,
    T_AlterTableMoveAllStmt = 317,
    T_SecLabelStmt = 318,
    T_CreateForeignTableStmt = 319,
    T_ImportForeignSchemaStmt = 320,
    T_CreateExtensionStmt = 321,
    T_AlterExtensionStmt = 322,
    T_AlterExtensionContentsStmt = 323,
    T_CreateEventTrigStmt = 324,
    T_AlterEventTrigStmt = 325,
    T_RefreshMatViewStmt = 326,
    T_ReplicaIdentityStmt = 327,
    T_AlterSystemStmt = 328,
    T_CreatePolicyStmt = 329,
    T_AlterPolicyStmt = 330,
    T_CreateTransformStmt = 331,
    T_CreateAmStmt = 332,
    T_CreatePublicationStmt = 333,
    T_AlterPublicationStmt = 334,
    T_CreateSubscriptionStmt = 335,
    T_AlterSubscriptionStmt = 336,
    T_DropSubscriptionStmt = 337,
    T_CreateStatsStmt = 338,
    T_AlterCollationStmt = 339,
    T_CallStmt = 340,
    T_A_Expr = 341,
    T_ColumnRef = 342,
    T_ParamRef = 343,
    T_A_Const = 344,
    T_FuncCall = 345,
    T_A_Star = 346,
    T_A_Indices = 347,
    T_A_Indirection = 348,
    T_A_ArrayExpr = 349,
    T_ResTarget = 350,
    T_MultiAssignRef = 351,
    T_TypeCast = 352,
    T_CollateClause = 353,
    T_SortBy = 354,
    T_WindowDef = 355,
    T_RangeSubselect = 356,
    T_RangeFunction = 357,
    T_RangeTableSample = 358,
    T_RangeTableFunc = 359,
    T_RangeTableFuncCol = 360,
    T_TypeName = 361,
    T_ColumnDef = 362,
    T_IndexElem = 363,
    T_Constraint = 364,
    T_DefElem = 365,
    T_RangeTblEntry = 366,
    T_RangeTblFunction = 367,
    T_TableSampleClause = 368,
    T_WithCheckOption = 369,
    T_SortGroupClause = 370,
    T_GroupingSet = 371,
    T_WindowClause = 372,
    T_ObjectWithArgs = 373,
    T_AccessPriv = 374,
    T_CreateOpClassItem = 375,
    T_TableLikeClause = 376,
    T_FunctionParameter = 377,
    T_LockingClause = 378,
    T_RowMarkClause = 379,
    T_XmlSerialize = 380,
    T_WithClause = 381,
    T_InferClause = 382,
    T_OnConflictClause = 383,
    T_CommonTableExpr = 384,
    T_RoleSpec = 385,
    T_TriggerTransition = 386,
    T_PartitionElem = 387,
    T_PartitionSpec = 388,
    T_PartitionBoundSpec = 389,
    T_PartitionRangeDatum = 390,
    T_PartitionCmd = 391,
    T_VacuumRelation = 392,
    T_IdentifySystemCmd = 393,
    T_BaseBackupCmd = 394,
    T_CreateReplicationSlotCmd = 395,
    T_DropReplicationSlotCmd = 396,
    T_StartReplicationCmd = 397,
    T_TimeLineHistoryCmd = 398,
    T_SQLCmd = 399,
    T_TriggerData = 400,
    T_EventTriggerData = 401,
    T_ReturnSetInfo = 402,
    T_WindowObjectData = 403,
    T_TIDBitmap = 404,
    T_InlineCodeBlock = 405,
    T_FdwRoutine = 406,
    T_IndexAmRoutine = 407,
    T_TableAmRoutine = 408,
    T_TsmRoutine = 409,
    T_ForeignKeyCacheInfo = 410,
    T_CallContext = 411,
    T_SupportRequestSimplify = 412,
    T_SupportRequestSelectivity = 413,
    T_SupportRequestCost = 414,
    T_SupportRequestRows = 415,
    T_SupportRequestIndexCondition = 416,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Node {
    pub type_: NodeTag,
}
#[test]
fn bindgen_test_layout_Node() {
    assert_eq!(
        ::std::mem::size_of::<Node>(),
        4usize,
        concat!("Size of: ", stringify!(Node))
    );
    assert_eq!(
        ::std::mem::align_of::<Node>(),
        4usize,
        concat!("Alignment of ", stringify!(Node))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Node>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Node),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for Node {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CmdType {
    CMD_UNKNOWN = 0,
    CMD_SELECT = 1,
    CMD_UPDATE = 2,
    CMD_INSERT = 3,
    CMD_DELETE = 4,
    CMD_UTILITY = 5,
    CMD_NOTHING = 6,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum JoinType {
    JOIN_INNER = 0,
    JOIN_LEFT = 1,
    JOIN_FULL = 2,
    JOIN_RIGHT = 3,
    JOIN_SEMI = 4,
    JOIN_ANTI = 5,
    JOIN_UNIQUE_OUTER = 6,
    JOIN_UNIQUE_INNER = 7,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum AggSplit {
    AGGSPLIT_SIMPLE = 0,
    AGGSPLIT_INITIAL_SERIAL = 6,
    AGGSPLIT_FINAL_DESERIAL = 9,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum OnConflictAction {
    ONCONFLICT_NONE = 0,
    ONCONFLICT_NOTHING = 1,
    ONCONFLICT_UPDATE = 2,
}
#[repr(C)]
#[derive(Debug, Default, Hash, PartialEq, Eq)]
pub struct MemoryContextCounters {
    pub nblocks: Size,
    pub freechunks: Size,
    pub totalspace: Size,
    pub freespace: Size,
}
#[test]
fn bindgen_test_layout_MemoryContextCounters() {
    assert_eq!(
        ::std::mem::size_of::<MemoryContextCounters>(),
        32usize,
        concat!("Size of: ", stringify!(MemoryContextCounters))
    );
    assert_eq!(
        ::std::mem::align_of::<MemoryContextCounters>(),
        8usize,
        concat!("Alignment of ", stringify!(MemoryContextCounters))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextCounters>())).nblocks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCounters),
            "::",
            stringify!(nblocks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MemoryContextCounters>())).freechunks as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCounters),
            "::",
            stringify!(freechunks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MemoryContextCounters>())).totalspace as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCounters),
            "::",
            stringify!(totalspace)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextCounters>())).freespace as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextCounters),
            "::",
            stringify!(freespace)
        )
    );
}
pub type MemoryStatsPrintFunc = ::std::option::Option<
    unsafe extern "C" fn(
        context: MemoryContext,
        passthru: *mut ::std::os::raw::c_void,
        stats_string: *const ::std::os::raw::c_char,
    ),
>;
#[repr(C)]
#[derive(Debug, Default, Hash, PartialEq, Eq)]
pub struct MemoryContextMethods {
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(context: MemoryContext, size: Size) -> *mut ::std::os::raw::c_void,
    >,
    pub free_p: ::std::option::Option<
        unsafe extern "C" fn(context: MemoryContext, pointer: *mut ::std::os::raw::c_void),
    >,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            context: MemoryContext,
            pointer: *mut ::std::os::raw::c_void,
            size: Size,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub reset: ::std::option::Option<unsafe extern "C" fn(context: MemoryContext)>,
    pub delete_context: ::std::option::Option<unsafe extern "C" fn(context: MemoryContext)>,
    pub get_chunk_space: ::std::option::Option<
        unsafe extern "C" fn(context: MemoryContext, pointer: *mut ::std::os::raw::c_void) -> Size,
    >,
    pub is_empty: ::std::option::Option<unsafe extern "C" fn(context: MemoryContext) -> bool>,
    pub stats: ::std::option::Option<
        unsafe extern "C" fn(
            context: MemoryContext,
            printfunc: MemoryStatsPrintFunc,
            passthru: *mut ::std::os::raw::c_void,
            totals: *mut MemoryContextCounters,
        ),
    >,
}
#[test]
fn bindgen_test_layout_MemoryContextMethods() {
    assert_eq!(
        ::std::mem::size_of::<MemoryContextMethods>(),
        64usize,
        concat!("Size of: ", stringify!(MemoryContextMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<MemoryContextMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(MemoryContextMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).alloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).free_p as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(free_p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).realloc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(realloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).reset as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MemoryContextMethods>())).delete_context as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(delete_context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MemoryContextMethods>())).get_chunk_space as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(get_chunk_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).is_empty as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(is_empty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextMethods>())).stats as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextMethods),
            "::",
            stringify!(stats)
        )
    );
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct MemoryContextData {
    pub type_: NodeTag,
    pub isReset: bool,
    pub allowInCritSection: bool,
    pub methods: *const MemoryContextMethods,
    pub parent: MemoryContext,
    pub firstchild: MemoryContext,
    pub prevchild: MemoryContext,
    pub nextchild: MemoryContext,
    pub name: *const ::std::os::raw::c_char,
    pub ident: *const ::std::os::raw::c_char,
    pub reset_cbs: *mut MemoryContextCallback,
}
#[test]
fn bindgen_test_layout_MemoryContextData() {
    assert_eq!(
        ::std::mem::size_of::<MemoryContextData>(),
        72usize,
        concat!("Size of: ", stringify!(MemoryContextData))
    );
    assert_eq!(
        ::std::mem::align_of::<MemoryContextData>(),
        8usize,
        concat!("Alignment of ", stringify!(MemoryContextData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).isReset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(isReset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MemoryContextData>())).allowInCritSection as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(allowInCritSection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).methods as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).firstchild as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(firstchild)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).prevchild as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(prevchild)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).nextchild as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(nextchild)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).ident as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(ident)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MemoryContextData>())).reset_cbs as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MemoryContextData),
            "::",
            stringify!(reset_cbs)
        )
    );
}
impl Default for MemoryContextData {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type bitmapword = uint64;
#[repr(C)]
#[derive(Debug, Default)]
pub struct Bitmapset {
    pub nwords: ::std::os::raw::c_int,
    pub words: __IncompleteArrayField<bitmapword>,
}
#[test]
fn bindgen_test_layout_Bitmapset() {
    assert_eq!(
        ::std::mem::size_of::<Bitmapset>(),
        8usize,
        concat!("Size of: ", stringify!(Bitmapset))
    );
    assert_eq!(
        ::std::mem::align_of::<Bitmapset>(),
        8usize,
        concat!("Alignment of ", stringify!(Bitmapset))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Bitmapset>())).nwords as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Bitmapset),
            "::",
            stringify!(nwords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Bitmapset>())).words as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Bitmapset),
            "::",
            stringify!(words)
        )
    );
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum LockClauseStrength {
    LCS_NONE = 0,
    LCS_FORKEYSHARE = 1,
    LCS_FORSHARE = 2,
    LCS_FORNOKEYUPDATE = 3,
    LCS_FORUPDATE = 4,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum LockWaitPolicy {
    LockWaitBlock = 0,
    LockWaitSkip = 1,
    LockWaitError = 2,
}
pub type AttrNumber = int16;
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct List {
    pub type_: NodeTag,
    pub length: ::std::os::raw::c_int,
    pub head: *mut ListCell,
    pub tail: *mut ListCell,
}
#[test]
fn bindgen_test_layout_List() {
    assert_eq!(
        ::std::mem::size_of::<List>(),
        24usize,
        concat!("Size of: ", stringify!(List))
    );
    assert_eq!(
        ::std::mem::align_of::<List>(),
        8usize,
        concat!("Alignment of ", stringify!(List))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<List>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(List),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<List>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(List),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<List>())).head as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(List),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<List>())).tail as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(List),
            "::",
            stringify!(tail)
        )
    );
}
impl Default for List {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct ListCell {
    pub data: ListCell__bindgen_ty_1,
    pub next: *mut ListCell,
}
#[repr(C)]
pub struct ListCell__bindgen_ty_1 {
    pub ptr_value: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    pub int_value: __BindgenUnionField<::std::os::raw::c_int>,
    pub oid_value: __BindgenUnionField<Oid>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_ListCell__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ListCell__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ListCell__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ListCell__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ListCell__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ListCell__bindgen_ty_1>())).ptr_value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ListCell__bindgen_ty_1),
            "::",
            stringify!(ptr_value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ListCell__bindgen_ty_1>())).int_value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ListCell__bindgen_ty_1),
            "::",
            stringify!(int_value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ListCell__bindgen_ty_1>())).oid_value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ListCell__bindgen_ty_1),
            "::",
            stringify!(oid_value)
        )
    );
}
impl Default for ListCell__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_ListCell() {
    assert_eq!(
        ::std::mem::size_of::<ListCell>(),
        16usize,
        concat!("Size of: ", stringify!(ListCell))
    );
    assert_eq!(
        ::std::mem::align_of::<ListCell>(),
        8usize,
        concat!("Alignment of ", stringify!(ListCell))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ListCell>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ListCell),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ListCell>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ListCell),
            "::",
            stringify!(next)
        )
    );
}
impl Default for ListCell {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn list_nth(list: *const List, n: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
}
#[doc = " Alias"]
#[doc = "   specifies an alias for a range variable; the alias might also"]
#[doc = "   specify renaming of columns within the table."]
#[doc = ""]
#[doc = " Note: colnames is a list of Value nodes (always strings).  In Alias structs"]
#[doc = " associated with RTEs, there may be entries corresponding to dropped"]
#[doc = " columns; these are normally empty strings (\"\").  See parsenodes.h for info."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Alias {
    pub type_: NodeTag,
    pub aliasname: *mut ::std::os::raw::c_char,
    #[doc = " aliased rel name (never qualified)"]
    pub colnames: *mut List,
}
#[test]
fn bindgen_test_layout_Alias() {
    assert_eq!(
        ::std::mem::size_of::<Alias>(),
        24usize,
        concat!("Size of: ", stringify!(Alias))
    );
    assert_eq!(
        ::std::mem::align_of::<Alias>(),
        8usize,
        concat!("Alignment of ", stringify!(Alias))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Alias>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Alias),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Alias>())).aliasname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Alias),
            "::",
            stringify!(aliasname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Alias>())).colnames as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Alias),
            "::",
            stringify!(colnames)
        )
    );
}
impl Default for Alias {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " What to do at commit time for temporary relations"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum OnCommitAction {
    ONCOMMIT_NOOP = 0,
    #[doc = " No ON COMMIT clause (do nothing)"]
    ONCOMMIT_PRESERVE_ROWS = 1,
    #[doc = " ON COMMIT PRESERVE ROWS (do nothing)"]
    ONCOMMIT_DELETE_ROWS = 2,
    #[doc = " ON COMMIT DELETE ROWS"]
    ONCOMMIT_DROP = 3,
}
#[doc = " RangeVar  range variable, used in FROM clauses"]
#[doc = ""]
#[doc = " Also used to represent table names in utility statements; there, the alias"]
#[doc = " field is not used, and inh tells whether to apply the operation"]
#[doc = " recursively to child tables.  In some contexts it is also useful to carry"]
#[doc = " a TEMP table indication here."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeVar {
    pub type_: NodeTag,
    pub catalogname: *mut ::std::os::raw::c_char,
    #[doc = " the catalog (database) name, or NULL"]
    pub schemaname: *mut ::std::os::raw::c_char,
    #[doc = " the schema name, or NULL"]
    pub relname: *mut ::std::os::raw::c_char,
    #[doc = " the relation/sequence name"]
    pub inh: bool,
    #[doc = " expand rel by inheritance? recursively act"]
    #[doc = " on children?"]
    pub relpersistence: ::std::os::raw::c_char,
    #[doc = " see RELPERSISTENCE_* in pg_class.h"]
    pub alias: *mut Alias,
    #[doc = " table alias & optional column aliases"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RangeVar() {
    assert_eq!(
        ::std::mem::size_of::<RangeVar>(),
        56usize,
        concat!("Size of: ", stringify!(RangeVar))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeVar>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeVar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).catalogname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(catalogname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).schemaname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(schemaname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).relname as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(relname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).inh as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(inh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).relpersistence as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(relpersistence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).alias as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeVar>())).location as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeVar),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RangeVar {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " TableFunc  node for a table function, such as XMLTABLE."]
#[doc = ""]
#[doc = " Entries in the ns_names list are either string Value nodes containing"]
#[doc = " literal namespace names, or NULL pointers to represent DEFAULT."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct TableFunc {
    pub type_: NodeTag,
    pub ns_uris: *mut List,
    #[doc = " list of namespace URI expressions"]
    pub ns_names: *mut List,
    #[doc = " list of namespace names or NULL"]
    pub docexpr: *mut Node,
    #[doc = " input document expression"]
    pub rowexpr: *mut Node,
    #[doc = " row filter expression"]
    pub colnames: *mut List,
    #[doc = " column names (list of String)"]
    pub coltypes: *mut List,
    #[doc = " OID list of column type OIDs"]
    pub coltypmods: *mut List,
    #[doc = " integer list of column typmods"]
    pub colcollations: *mut List,
    #[doc = " OID list of column collation OIDs"]
    pub colexprs: *mut List,
    #[doc = " list of column filter expressions"]
    pub coldefexprs: *mut List,
    #[doc = " list of column default expressions"]
    pub notnulls: *mut Bitmapset,
    #[doc = " nullability flag for each output column"]
    pub ordinalitycol: ::std::os::raw::c_int,
    #[doc = " counts from 0; 1 if none specified"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TableFunc() {
    assert_eq!(
        ::std::mem::size_of::<TableFunc>(),
        104usize,
        concat!("Size of: ", stringify!(TableFunc))
    );
    assert_eq!(
        ::std::mem::align_of::<TableFunc>(),
        8usize,
        concat!("Alignment of ", stringify!(TableFunc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).ns_uris as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(ns_uris)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).ns_names as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(ns_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).docexpr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(docexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).rowexpr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(rowexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).colnames as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(colnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).coltypes as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(coltypes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).coltypmods as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(coltypmods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).colcollations as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(colcollations)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).colexprs as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(colexprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).coldefexprs as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(coldefexprs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).notnulls as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(notnulls)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).ordinalitycol as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(ordinalitycol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableFunc>())).location as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunc),
            "::",
            stringify!(location)
        )
    );
}
impl Default for TableFunc {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " IntoClause  target information for SELECT INTO, CREATE TABLE AS, and"]
#[doc = " CREATE MATERIALIZED VIEW"]
#[doc = ""]
#[doc = " For CREATE MATERIALIZED VIEW, viewQuery is the parsedbutnotrewritten"]
#[doc = " SELECT Query for the view; otherwise it's NULL.  (Although it's actually"]
#[doc = " Query*, we declare it as Node* to avoid a forward reference.)"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct IntoClause {
    pub type_: NodeTag,
    pub rel: *mut RangeVar,
    #[doc = " target relation name"]
    pub colNames: *mut List,
    #[doc = " column names to assign, or NIL"]
    pub accessMethod: *mut ::std::os::raw::c_char,
    #[doc = " table access method"]
    pub options: *mut List,
    #[doc = " options from WITH clause"]
    pub onCommit: OnCommitAction,
    #[doc = " what do we do at COMMIT?"]
    pub tableSpaceName: *mut ::std::os::raw::c_char,
    #[doc = " table space to use, or NULL"]
    pub viewQuery: *mut Node,
    #[doc = " materialized view's SELECT query"]
    pub skipData: bool,
}
#[test]
fn bindgen_test_layout_IntoClause() {
    assert_eq!(
        ::std::mem::size_of::<IntoClause>(),
        72usize,
        concat!("Size of: ", stringify!(IntoClause))
    );
    assert_eq!(
        ::std::mem::align_of::<IntoClause>(),
        8usize,
        concat!("Alignment of ", stringify!(IntoClause))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).rel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(rel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).colNames as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(colNames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).accessMethod as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(accessMethod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).options as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).onCommit as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(onCommit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).tableSpaceName as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(tableSpaceName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).viewQuery as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(viewQuery)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IntoClause>())).skipData as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(IntoClause),
            "::",
            stringify!(skipData)
        )
    );
}
impl Default for IntoClause {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Expr  generic superclass for executableexpression nodes"]
#[doc = ""]
#[doc = " All node types that are used in executable expression trees should derive"]
#[doc = " from Expr (that is, have Expr as their first field).  Since Expr only"]
#[doc = " contains NodeTag, this is a formality, but it is an easy form of"]
#[doc = " documentation.  See also the ExprState node types in execnodes.h."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Expr {
    pub type_: NodeTag,
}
#[test]
fn bindgen_test_layout_Expr() {
    assert_eq!(
        ::std::mem::size_of::<Expr>(),
        4usize,
        concat!("Size of: ", stringify!(Expr))
    );
    assert_eq!(
        ::std::mem::align_of::<Expr>(),
        4usize,
        concat!("Alignment of ", stringify!(Expr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Expr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Expr),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for Expr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Var {
    pub xpr: Expr,
    pub varno: Index,
    #[doc = " index of this var's relation in the range"]
    #[doc = " table, or INNER_VAR/OUTER_VAR/INDEX_VAR"]
    pub varattno: AttrNumber,
    #[doc = " attribute number of this var, or zero for"]
    #[doc = " all attrs (\"wholerow Var\")"]
    pub vartype: Oid,
    #[doc = " pg_type OID for the type of this var"]
    pub vartypmod: int32,
    #[doc = " pg_attribute typmod value"]
    pub varcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub varlevelsup: Index,
    #[doc = " for subquery variables referencing outer"]
    #[doc = " relations; 0 in a normal var, >0 means N"]
    #[doc = " levels up"]
    pub varnoold: Index,
    #[doc = " original value of varno, for debugging"]
    pub varoattno: AttrNumber,
    #[doc = " original value of varattno"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Var() {
    assert_eq!(
        ::std::mem::size_of::<Var>(),
        40usize,
        concat!("Size of: ", stringify!(Var))
    );
    assert_eq!(
        ::std::mem::align_of::<Var>(),
        4usize,
        concat!("Alignment of ", stringify!(Var))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).xpr as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Var), "::", stringify!(xpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varattno as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varattno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).vartype as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(vartype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).vartypmod as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(vartypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varcollid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varlevelsup as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varlevelsup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varnoold as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varnoold)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).varoattno as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(varoattno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Var>())).location as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Var),
            "::",
            stringify!(location)
        )
    );
}
impl Default for Var {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Const"]
#[doc = ""]
#[doc = " Note: for varlena data types, we make a rule that a Const node's value"]
#[doc = " must be in nonextended form (4byte header, no compression or external"]
#[doc = " references).  This ensures that the Const node is selfcontained and makes"]
#[doc = " it more likely that equal() will see logically identical values as equal."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Const {
    pub xpr: Expr,
    pub consttype: Oid,
    #[doc = " pg_type OID of the constant's datatype"]
    pub consttypmod: int32,
    #[doc = " typmod value, if any"]
    pub constcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub constlen: ::std::os::raw::c_int,
    #[doc = " typlen of the constant's datatype"]
    pub constvalue: Datum,
    #[doc = " the constant's value"]
    pub constisnull: bool,
    #[doc = " whether the constant is null (if true,"]
    #[doc = " constvalue is undefined)"]
    pub constbyval: bool,
    #[doc = " whether this datatype is passed by value."]
    #[doc = " If true, then all the information is stored"]
    #[doc = " in the Datum. If false, then the Datum"]
    #[doc = " contains a pointer to the information."]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Const() {
    assert_eq!(
        ::std::mem::size_of::<Const>(),
        40usize,
        concat!("Size of: ", stringify!(Const))
    );
    assert_eq!(
        ::std::mem::align_of::<Const>(),
        8usize,
        concat!("Alignment of ", stringify!(Const))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).consttype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(consttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).consttypmod as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(consttypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).constcollid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(constcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).constlen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(constlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).constvalue as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(constvalue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).constisnull as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(constisnull)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).constbyval as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(constbyval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Const>())).location as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Const),
            "::",
            stringify!(location)
        )
    );
}
impl Default for Const {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " Param"]
#[doc = ""]
#[doc = "    paramkind specifies the kind of parameter. The possible values"]
#[doc = "    for this field are:"]
#[doc = ""]
#[doc = "    PARAM_EXTERN:  The parameter value is supplied from outside the plan."]
#[doc = "          Such parameters are numbered from 1 to n."]
#[doc = ""]
#[doc = "    PARAM_EXEC:  The parameter is an internal executor parameter, used"]
#[doc = "          for passing values into and out of subqueries or from"]
#[doc = "          nestloop joins to their inner scans."]
#[doc = "          For historical reasons, such parameters are numbered from 0."]
#[doc = "          These numbers are independent of PARAM_EXTERN numbers."]
#[doc = ""]
#[doc = "    PARAM_SUBLINK: The parameter represents an output column of a SubLink"]
#[doc = "          node's subselect.  The column number is contained in the"]
#[doc = "          'paramid' field.  (This type of Param is converted to"]
#[doc = "          PARAM_EXEC during planning.)"]
#[doc = ""]
#[doc = "    PARAM_MULTIEXPR:  Like PARAM_SUBLINK, the parameter represents an"]
#[doc = "          output column of a SubLink node's subselect, but here, the"]
#[doc = "          SubLink is always a MULTIEXPR SubLink.  The highorder 16 bits"]
#[doc = "          of the 'paramid' field contain the SubLink's subLinkId, and"]
#[doc = "          the loworder 16 bits contain the column number.  (This type"]
#[doc = "          of Param is also converted to PARAM_EXEC during planning.)"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum ParamKind {
    PARAM_EXTERN = 0,
    PARAM_EXEC = 1,
    PARAM_SUBLINK = 2,
    PARAM_MULTIEXPR = 3,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Param {
    pub xpr: Expr,
    pub paramkind: ParamKind,
    #[doc = " kind of parameter. See above"]
    pub paramid: ::std::os::raw::c_int,
    #[doc = " numeric ID for parameter"]
    pub paramtype: Oid,
    #[doc = " pg_type OID of parameter's datatype"]
    pub paramtypmod: int32,
    #[doc = " typmod value, if known"]
    pub paramcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Param() {
    assert_eq!(
        ::std::mem::size_of::<Param>(),
        28usize,
        concat!("Size of: ", stringify!(Param))
    );
    assert_eq!(
        ::std::mem::align_of::<Param>(),
        4usize,
        concat!("Alignment of ", stringify!(Param))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).paramkind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(paramkind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).paramid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(paramid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).paramtype as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(paramtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).paramtypmod as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(paramtypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).paramcollid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(paramcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Param>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Param),
            "::",
            stringify!(location)
        )
    );
}
impl Default for Param {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Aggref"]
#[doc = ""]
#[doc = " The aggregate's args list is a targetlist, ie, a list of TargetEntry nodes."]
#[doc = ""]
#[doc = " For a normal (nonorderedset) aggregate, the nonresjunk TargetEntries"]
#[doc = " represent the aggregate's regular arguments (if any) and resjunk TLEs can"]
#[doc = " be added at the end to represent ORDER BY expressions that are not also"]
#[doc = " arguments.  As in a toplevel Query, the TLEs can be marked with"]
#[doc = " ressortgroupref indexes to let them be referenced by SortGroupClause"]
#[doc = " entries in the aggorder and/or aggdistinct lists.  This represents ORDER BY"]
#[doc = " and DISTINCT operations to be applied to the aggregate input rows before"]
#[doc = " they are passed to the transition function.  The grammar only allows a"]
#[doc = " simple \"DISTINCT\" specifier for the arguments, but we use the full"]
#[doc = " querylevel representation to allow more code sharing."]
#[doc = ""]
#[doc = " For an orderedset aggregate, the args list represents the WITHIN GROUP"]
#[doc = " (aggregated) arguments, all of which will be listed in the aggorder list."]
#[doc = " DISTINCT is not supported in this case, so aggdistinct will be NIL."]
#[doc = " The direct arguments appear in aggdirectargs (as a list of plain"]
#[doc = " expressions, not TargetEntry nodes)."]
#[doc = ""]
#[doc = " aggtranstype is the data type of the state transition values for this"]
#[doc = " aggregate (resolved to an actual type, if agg's transtype is polymorphic)."]
#[doc = " This is determined during planning and is InvalidOid before that."]
#[doc = ""]
#[doc = " aggargtypes is an OID list of the data types of the direct and regular"]
#[doc = " arguments.  Normally it's redundant with the aggdirectargs and args lists,"]
#[doc = " but in a combining aggregate, it's not because the args list has been"]
#[doc = " replaced with a single argument representing the partialaggregate"]
#[doc = " transition values."]
#[doc = ""]
#[doc = " aggsplit indicates the expected partialaggregation mode for the Aggref's"]
#[doc = " parent plan node.  It's always set to AGGSPLIT_SIMPLE in the parser, but"]
#[doc = " the planner might change it to something else.  We use this mainly as"]
#[doc = " a crosscheck that the Aggrefs match the plan; but note that when aggsplit"]
#[doc = " indicates a nonfinal mode, aggtype reflects the transition data type"]
#[doc = " not the SQLlevel output type of the aggregate."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct Aggref {
    pub xpr: Expr,
    pub aggfnoid: Oid,
    #[doc = " pg_proc Oid of the aggregate"]
    pub aggtype: Oid,
    #[doc = " type Oid of result of the aggregate"]
    pub aggcollid: Oid,
    #[doc = " OID of collation of result"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that function should use"]
    pub aggtranstype: Oid,
    #[doc = " type Oid of aggregate's transition value"]
    pub aggargtypes: *mut List,
    #[doc = " type Oids of direct and aggregated args"]
    pub aggdirectargs: *mut List,
    #[doc = " direct arguments, if an orderedset agg"]
    pub args: *mut List,
    #[doc = " aggregated arguments and sort expressions"]
    pub aggorder: *mut List,
    #[doc = " ORDER BY (list of SortGroupClause)"]
    pub aggdistinct: *mut List,
    #[doc = " DISTINCT (list of SortGroupClause)"]
    pub aggfilter: *mut Expr,
    #[doc = " FILTER expression, if any"]
    pub aggstar: bool,
    #[doc = " true if argument list was really '*'"]
    pub aggvariadic: bool,
    #[doc = " true if variadic arguments have been"]
    #[doc = " combined into an array last argument"]
    pub aggkind: ::std::os::raw::c_char,
    #[doc = " aggregate kind (see pg_aggregate.h)"]
    pub agglevelsup: Index,
    #[doc = " > 0 if agg belongs to outer query"]
    pub aggsplit: AggSplit,
    #[doc = " expected aggsplitting mode of parent Agg"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Aggref() {
    assert_eq!(
        ::std::mem::size_of::<Aggref>(),
        88usize,
        concat!("Size of: ", stringify!(Aggref))
    );
    assert_eq!(
        ::std::mem::align_of::<Aggref>(),
        8usize,
        concat!("Alignment of ", stringify!(Aggref))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggfnoid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggfnoid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggtype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggcollid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).inputcollid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggtranstype as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggtranstype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggargtypes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggargtypes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggdirectargs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggdirectargs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).args as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggorder as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggorder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggdistinct as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggdistinct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggfilter as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggfilter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggstar as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggstar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggvariadic as *const _ as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggvariadic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggkind as *const _ as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggkind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).agglevelsup as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(agglevelsup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).aggsplit as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(aggsplit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Aggref>())).location as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Aggref),
            "::",
            stringify!(location)
        )
    );
}
impl Default for Aggref {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " GroupingFunc"]
#[doc = ""]
#[doc = " A GroupingFunc is a GROUPING(...) expression, which behaves in many ways"]
#[doc = " like an aggregate function (e.g. it \"belongs\" to a specific query level,"]
#[doc = " which might not be the one immediately containing it), but also differs in"]
#[doc = " an important respect: it never evaluates its arguments, they merely"]
#[doc = " designate expressions from the GROUP BY clause of the query level to which"]
#[doc = " it belongs."]
#[doc = ""]
#[doc = " The spec defines the evaluation of GROUPING() purely by syntactic"]
#[doc = " replacement, but we make it a real expression for optimization purposes so"]
#[doc = " that one Agg node can handle multiple grouping sets at once.  Evaluating the"]
#[doc = " result only needs the column positions to check against the grouping set"]
#[doc = " being projected.  However, for EXPLAIN to produce meaningful output, we have"]
#[doc = " to keep the original expressions around, since expression deparse does not"]
#[doc = " give us any feasible way to get at the GROUP BY clause."]
#[doc = ""]
#[doc = " Also, we treat two GroupingFunc nodes as equal if they have equal arguments"]
#[doc = " lists and agglevelsup, without comparing the refs and cols annotations."]
#[doc = ""]
#[doc = " In raw parse output we have only the args list; parse analysis fills in the"]
#[doc = " refs list, and the planner fills in the cols list."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct GroupingFunc {
    pub xpr: Expr,
    pub args: *mut List,
    #[doc = " arguments, not evaluated but kept for"]
    #[doc = " benefit of EXPLAIN etc."]
    pub refs: *mut List,
    #[doc = " ressortgrouprefs of arguments"]
    pub cols: *mut List,
    #[doc = " actual column positions set by planner"]
    pub agglevelsup: Index,
    #[doc = " same as Aggref.agglevelsup"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GroupingFunc() {
    assert_eq!(
        ::std::mem::size_of::<GroupingFunc>(),
        40usize,
        concat!("Size of: ", stringify!(GroupingFunc))
    );
    assert_eq!(
        ::std::mem::align_of::<GroupingFunc>(),
        8usize,
        concat!("Alignment of ", stringify!(GroupingFunc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).args as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).cols as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(cols)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).agglevelsup as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(agglevelsup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupingFunc>())).location as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupingFunc),
            "::",
            stringify!(location)
        )
    );
}
impl Default for GroupingFunc {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " WindowFunc"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct WindowFunc {
    pub xpr: Expr,
    pub winfnoid: Oid,
    #[doc = " pg_proc Oid of the function"]
    pub wintype: Oid,
    #[doc = " type Oid of result of the window function"]
    pub wincollid: Oid,
    #[doc = " OID of collation of result"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that function should use"]
    pub args: *mut List,
    #[doc = " arguments to the window function"]
    pub aggfilter: *mut Expr,
    #[doc = " FILTER expression, if any"]
    pub winref: Index,
    #[doc = " index of associated WindowClause"]
    pub winstar: bool,
    #[doc = " true if argument list was really '*'"]
    pub winagg: bool,
    #[doc = " is function a simple aggregate?"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_WindowFunc() {
    assert_eq!(
        ::std::mem::size_of::<WindowFunc>(),
        56usize,
        concat!("Size of: ", stringify!(WindowFunc))
    );
    assert_eq!(
        ::std::mem::align_of::<WindowFunc>(),
        8usize,
        concat!("Alignment of ", stringify!(WindowFunc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).winfnoid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(winfnoid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).wintype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(wintype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).wincollid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(wincollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).inputcollid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).aggfilter as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(aggfilter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).winref as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(winref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).winstar as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(winstar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).winagg as *const _ as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(winagg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowFunc>())).location as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowFunc),
            "::",
            stringify!(location)
        )
    );
}
impl Default for WindowFunc {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " SubscriptingRef: describes a subscripting operation over a container"]
#[doc = "       (array, etc)."]
#[doc = ""]
#[doc = " A SubscriptingRef can describe fetching a single element from a container,"]
#[doc = " fetching a part of container (e.g. array slice), storing a single element into"]
#[doc = " a container, or storing a slice.  The \"store\" cases work with an"]
#[doc = " initial container value and a source value that is inserted into the"]
#[doc = " appropriate part of the container; the result of the operation is an"]
#[doc = " entire new modified container value."]
#[doc = ""]
#[doc = " If reflowerindexpr = NIL, then we are fetching or storing a single container"]
#[doc = " element at the subscripts given by refupperindexpr. Otherwise we are"]
#[doc = " fetching or storing a container slice, that is a rectangular subcontainer"]
#[doc = " with lower and upper bounds given by the index expressions."]
#[doc = " reflowerindexpr must be the same length as refupperindexpr when it"]
#[doc = " is not NIL."]
#[doc = ""]
#[doc = " In the slice case, individual expressions in the subscript lists can be"]
#[doc = " NULL, meaning \"substitute the array's current lower or upper bound\"."]
#[doc = ""]
#[doc = " Note: the result datatype is the element type when fetching a single"]
#[doc = " element; but it is the array type when doing subarray fetch or either"]
#[doc = " type of store."]
#[doc = ""]
#[doc = " Note: for the cases where a container is returned, if refexpr yields a R/W"]
#[doc = " expanded container, then the implementation is allowed to modify that object"]
#[doc = " inplace and return the same object.)"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct SubscriptingRef {
    pub xpr: Expr,
    pub refcontainertype: Oid,
    #[doc = " type of the container proper"]
    pub refelemtype: Oid,
    #[doc = " type of the container elements"]
    pub reftypmod: int32,
    #[doc = " typmod of the container (and elements too)"]
    pub refcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub refupperindexpr: *mut List,
    #[doc = " expressions that evaluate to upper"]
    #[doc = " container indexes"]
    pub reflowerindexpr: *mut List,
    #[doc = " expressions that evaluate to lower"]
    #[doc = " container indexes, or NIL for single"]
    #[doc = " container element"]
    pub refexpr: *mut Expr,
    #[doc = " the expression that evaluates to a"]
    #[doc = " container value"]
    pub refassgnexpr: *mut Expr,
}
#[test]
fn bindgen_test_layout_SubscriptingRef() {
    assert_eq!(
        ::std::mem::size_of::<SubscriptingRef>(),
        56usize,
        concat!("Size of: ", stringify!(SubscriptingRef))
    );
    assert_eq!(
        ::std::mem::align_of::<SubscriptingRef>(),
        8usize,
        concat!("Alignment of ", stringify!(SubscriptingRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SubscriptingRef>())).refcontainertype as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refcontainertype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).refelemtype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refelemtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).reftypmod as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(reftypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).refcollid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).refupperindexpr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refupperindexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).reflowerindexpr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(reflowerindexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).refexpr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubscriptingRef>())).refassgnexpr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SubscriptingRef),
            "::",
            stringify!(refassgnexpr)
        )
    );
}
impl Default for SubscriptingRef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " CoercionContext  distinguishes the allowed set of type casts"]
#[doc = ""]
#[doc = " NB: ordering of the alternatives is significant; later (larger) values"]
#[doc = " allow more casts than earlier ones."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CoercionContext {
    COERCION_IMPLICIT = 0,
    #[doc = " coercion in context of expression"]
    COERCION_ASSIGNMENT = 1,
    #[doc = " coercion in context of assignment"]
    COERCION_EXPLICIT = 2,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " CoercionForm  how to display a node that could have come from a cast"]
#[doc = ""]
#[doc = " NB: equal() ignores CoercionForm fields, therefore this *must* not carry"]
#[doc = " any semantically significant information.  We need that behavior so that"]
#[doc = " the planner will consider equivalent implicit and explicit casts to be"]
#[doc = " equivalent.  In cases where those actually behave differently, the coercion"]
#[doc = " function's arguments will be different."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CoercionForm {
    COERCE_EXPLICIT_CALL = 0,
    #[doc = " display as a function call"]
    COERCE_EXPLICIT_CAST = 1,
    #[doc = " display as an explicit cast"]
    COERCE_IMPLICIT_CAST = 2,
}
#[doc = " FuncExpr  expression node for a function call"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct FuncExpr {
    pub xpr: Expr,
    pub funcid: Oid,
    #[doc = " PG_PROC OID of the function"]
    pub funcresulttype: Oid,
    #[doc = " PG_TYPE OID of result value"]
    pub funcretset: bool,
    #[doc = " true if function returns set"]
    pub funcvariadic: bool,
    #[doc = " true if variadic arguments have been"]
    #[doc = " combined into an array last argument"]
    pub funcformat: CoercionForm,
    #[doc = " how to display this function call"]
    pub funccollid: Oid,
    #[doc = " OID of collation of result"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that function should use"]
    pub args: *mut List,
    #[doc = " arguments to the function"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FuncExpr() {
    assert_eq!(
        ::std::mem::size_of::<FuncExpr>(),
        48usize,
        concat!("Size of: ", stringify!(FuncExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<FuncExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(FuncExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funcid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funcid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funcresulttype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funcresulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funcretset as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funcretset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funcvariadic as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funcvariadic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funcformat as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funcformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).funccollid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(funccollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).inputcollid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).args as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncExpr>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for FuncExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " NamedArgExpr  a named argument of a function"]
#[doc = ""]
#[doc = " This node type can only appear in the args list of a FuncCall or FuncExpr"]
#[doc = " node.  We support pure positional call notation (no named arguments),"]
#[doc = " named notation (all arguments are named), and mixed notation (unnamed"]
#[doc = " arguments followed by named ones)."]
#[doc = ""]
#[doc = " Parse analysis sets argnumber to the positional index of the argument,"]
#[doc = " but doesn't rearrange the argument list."]
#[doc = ""]
#[doc = " The planner will convert argument lists to pure positional notation"]
#[doc = " during expression preprocessing, so execution never sees a NamedArgExpr."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct NamedArgExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " the argument expression"]
    pub name: *mut ::std::os::raw::c_char,
    #[doc = " the name"]
    pub argnumber: ::std::os::raw::c_int,
    #[doc = " argument's number in positional notation"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NamedArgExpr() {
    assert_eq!(
        ::std::mem::size_of::<NamedArgExpr>(),
        32usize,
        concat!("Size of: ", stringify!(NamedArgExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<NamedArgExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(NamedArgExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NamedArgExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NamedArgExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NamedArgExpr>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NamedArgExpr),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NamedArgExpr>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NamedArgExpr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NamedArgExpr>())).argnumber as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NamedArgExpr),
            "::",
            stringify!(argnumber)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NamedArgExpr>())).location as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(NamedArgExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for NamedArgExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " OpExpr  expression node for an operator invocation"]
#[doc = ""]
#[doc = " Semantically, this is essentially the same as a function call."]
#[doc = ""]
#[doc = " Note that opfuncid is not necessarily filled in immediately on creation"]
#[doc = " of the node.  The planner makes sure it is valid before passing the node"]
#[doc = " tree to the executor, but during parsing/planning opfuncid can be 0."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct OpExpr {
    pub xpr: Expr,
    pub opno: Oid,
    #[doc = " PG_OPERATOR OID of the operator"]
    pub opfuncid: Oid,
    #[doc = " PG_PROC OID of underlying function"]
    pub opresulttype: Oid,
    #[doc = " PG_TYPE OID of result value"]
    pub opretset: bool,
    #[doc = " true if operator returns set"]
    pub opcollid: Oid,
    #[doc = " OID of collation of result"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that operator should use"]
    pub args: *mut List,
    #[doc = " arguments to the operator (1 or 2)"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_OpExpr() {
    assert_eq!(
        ::std::mem::size_of::<OpExpr>(),
        48usize,
        concat!("Size of: ", stringify!(OpExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<OpExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(OpExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).opno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(opno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).opfuncid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(opfuncid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).opresulttype as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(opresulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).opretset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(opretset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).opcollid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(opcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).inputcollid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).args as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpExpr>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(OpExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for OpExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ScalarArrayOpExpr  expression node for \"scalar op ANY/ALL (array)\""]
#[doc = ""]
#[doc = " The operator must yield boolean.  It is applied to the left operand"]
#[doc = " and each element of the righthand array, and the results are combined"]
#[doc = " with OR or AND (for ANY or ALL respectively).  The node representation"]
#[doc = " is almost the same as for the underlying operator, but we need a useOr"]
#[doc = " flag to remember whether it's ANY or ALL, and we don't have to store"]
#[doc = " the result type (or the collation) because it must be boolean."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ScalarArrayOpExpr {
    pub xpr: Expr,
    pub opno: Oid,
    #[doc = " PG_OPERATOR OID of the operator"]
    pub opfuncid: Oid,
    #[doc = " PG_PROC OID of underlying function"]
    pub useOr: bool,
    #[doc = " true for ANY, false for ALL"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that operator should use"]
    pub args: *mut List,
    #[doc = " the scalar and array operands"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ScalarArrayOpExpr() {
    assert_eq!(
        ::std::mem::size_of::<ScalarArrayOpExpr>(),
        40usize,
        concat!("Size of: ", stringify!(ScalarArrayOpExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<ScalarArrayOpExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(ScalarArrayOpExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).opno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(opno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).opfuncid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(opfuncid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).useOr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(useOr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).inputcollid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScalarArrayOpExpr>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ScalarArrayOpExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ScalarArrayOpExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " BoolExpr  expression node for the basic Boolean operators AND, OR, NOT"]
#[doc = ""]
#[doc = " Notice the arguments are given as a List.  For NOT, of course the list"]
#[doc = " must always have exactly one element.  For AND and OR, there can be two"]
#[doc = " or more arguments."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum BoolExprType {
    AND_EXPR = 0,
    OR_EXPR = 1,
    NOT_EXPR = 2,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct BoolExpr {
    pub xpr: Expr,
    pub boolop: BoolExprType,
    pub args: *mut List,
    #[doc = " arguments to this expression"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_BoolExpr() {
    assert_eq!(
        ::std::mem::size_of::<BoolExpr>(),
        24usize,
        concat!("Size of: ", stringify!(BoolExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<BoolExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(BoolExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BoolExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BoolExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BoolExpr>())).boolop as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BoolExpr),
            "::",
            stringify!(boolop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BoolExpr>())).args as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BoolExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BoolExpr>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BoolExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for BoolExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " SubLink"]
#[doc = ""]
#[doc = " A SubLink represents a subselect appearing in an expression, and in some"]
#[doc = " cases also the combining operator(s) just above it.  The subLinkType"]
#[doc = " indicates the form of the expression represented:"]
#[doc = " EXISTS_SUBLINK    EXISTS(SELECT ...)"]
#[doc = " ALL_SUBLINK       (lefthand) op ALL (SELECT ...)"]
#[doc = " ANY_SUBLINK       (lefthand) op ANY (SELECT ...)"]
#[doc = " ROWCOMPARE_SUBLINK   (lefthand) op (SELECT ...)"]
#[doc = " EXPR_SUBLINK      (SELECT with single targetlist item ...)"]
#[doc = " MULTIEXPR_SUBLINK (SELECT with multiple targetlist items ...)"]
#[doc = " ARRAY_SUBLINK     ARRAY(SELECT with single targetlist item ...)"]
#[doc = " CTE_SUBLINK       WITH query (never actually part of an expression)"]
#[doc = " For ALL, ANY, and ROWCOMPARE, the lefthand is a list of expressions of the"]
#[doc = " same length as the subselect's targetlist.  ROWCOMPARE will *always* have"]
#[doc = " a list with more than one entry; if the subselect has just one target"]
#[doc = " then the parser will create an EXPR_SUBLINK instead (and any operator"]
#[doc = " above the subselect will be represented separately)."]
#[doc = " ROWCOMPARE, EXPR, and MULTIEXPR require the subselect to deliver at most"]
#[doc = " one row (if it returns no rows, the result is NULL)."]
#[doc = " ALL, ANY, and ROWCOMPARE require the combining operators to deliver boolean"]
#[doc = " results.  ALL and ANY combine the perrow results using AND and OR"]
#[doc = " semantics respectively."]
#[doc = " ARRAY requires just one target column, and creates an array of the target"]
#[doc = " column's type using any number of rows resulting from the subselect."]
#[doc = ""]
#[doc = " SubLink is classed as an Expr node, but it is not actually executable;"]
#[doc = " it must be replaced in the expression tree by a SubPlan node during"]
#[doc = " planning."]
#[doc = ""]
#[doc = " NOTE: in the raw output of gram.y, testexpr contains just the raw form"]
#[doc = " of the lefthand expression (if any), and operName is the String name of"]
#[doc = " the combining operator.  Also, subselect is a raw parsetree.  During parse"]
#[doc = " analysis, the parser transforms testexpr into a complete boolean expression"]
#[doc = " that compares the lefthand value(s) to PARAM_SUBLINK nodes representing the"]
#[doc = " output columns of the subselect.  And subselect is transformed to a Query."]
#[doc = " This is the representation seen in saved rules and in the rewriter."]
#[doc = ""]
#[doc = " In EXISTS, EXPR, MULTIEXPR, and ARRAY SubLinks, testexpr and operName"]
#[doc = " are unused and are always null."]
#[doc = ""]
#[doc = " subLinkId is currently used only for MULTIEXPR SubLinks, and is zero in"]
#[doc = " other SubLinks.  This number identifies different multipleassignment"]
#[doc = " subqueries within an UPDATE statement's SET list.  It is unique only"]
#[doc = " within a particular targetlist.  The output column(s) of the MULTIEXPR"]
#[doc = " are referenced by PARAM_MULTIEXPR Params appearing elsewhere in the tlist."]
#[doc = ""]
#[doc = " The CTE_SUBLINK case never occurs in actual SubLink nodes, but it is used"]
#[doc = " in SubPlans generated for WITH subqueries."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SubLinkType {
    EXISTS_SUBLINK = 0,
    ALL_SUBLINK = 1,
    ANY_SUBLINK = 2,
    ROWCOMPARE_SUBLINK = 3,
    EXPR_SUBLINK = 4,
    MULTIEXPR_SUBLINK = 5,
    ARRAY_SUBLINK = 6,
    CTE_SUBLINK = 7,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct SubLink {
    pub xpr: Expr,
    pub subLinkType: SubLinkType,
    #[doc = " see above"]
    pub subLinkId: ::std::os::raw::c_int,
    #[doc = " ID (1..n); 0 if not MULTIEXPR"]
    pub testexpr: *mut Node,
    #[doc = " outerquery test for ALL/ANY/ROWCOMPARE"]
    pub operName: *mut List,
    #[doc = " originally specified operator name"]
    pub subselect: *mut Node,
    #[doc = " subselect as Query* or raw parsetree"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SubLink() {
    assert_eq!(
        ::std::mem::size_of::<SubLink>(),
        48usize,
        concat!("Size of: ", stringify!(SubLink))
    );
    assert_eq!(
        ::std::mem::align_of::<SubLink>(),
        8usize,
        concat!("Alignment of ", stringify!(SubLink))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).subLinkType as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(subLinkType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).subLinkId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(subLinkId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).testexpr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(testexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).operName as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(operName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).subselect as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(subselect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubLink>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SubLink),
            "::",
            stringify!(location)
        )
    );
}
impl Default for SubLink {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " AlternativeSubPlan  expression node for a choice among SubPlans"]
#[doc = ""]
#[doc = " The subplans are given as a List so that the node definition need not"]
#[doc = " change if there's ever more than two alternatives.  For the moment,"]
#[doc = " though, there are always exactly two; and the first one is the faststart"]
#[doc = " plan."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct AlternativeSubPlan {
    pub xpr: Expr,
    pub subplans: *mut List,
}
#[test]
fn bindgen_test_layout_AlternativeSubPlan() {
    assert_eq!(
        ::std::mem::size_of::<AlternativeSubPlan>(),
        16usize,
        concat!("Size of: ", stringify!(AlternativeSubPlan))
    );
    assert_eq!(
        ::std::mem::align_of::<AlternativeSubPlan>(),
        8usize,
        concat!("Alignment of ", stringify!(AlternativeSubPlan))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AlternativeSubPlan>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AlternativeSubPlan),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AlternativeSubPlan>())).subplans as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AlternativeSubPlan),
            "::",
            stringify!(subplans)
        )
    );
}
impl Default for AlternativeSubPlan {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " FieldSelect"]
#[doc = ""]
#[doc = " FieldSelect represents the operation of extracting one field from a tuple"]
#[doc = " value.  At runtime, the input expression is expected to yield a rowtype"]
#[doc = " Datum.  The specified field number is extracted and returned as a Datum."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct FieldSelect {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub fieldnum: AttrNumber,
    #[doc = " attribute number of field to extract"]
    pub resulttype: Oid,
    #[doc = " type of the field (result type of this"]
    #[doc = " node)"]
    pub resulttypmod: int32,
    #[doc = " output typmod (usually 1)"]
    pub resultcollid: Oid,
}
#[test]
fn bindgen_test_layout_FieldSelect() {
    assert_eq!(
        ::std::mem::size_of::<FieldSelect>(),
        32usize,
        concat!("Size of: ", stringify!(FieldSelect))
    );
    assert_eq!(
        ::std::mem::align_of::<FieldSelect>(),
        8usize,
        concat!("Alignment of ", stringify!(FieldSelect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).fieldnum as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(fieldnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).resulttype as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).resulttypmod as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(resulttypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldSelect>())).resultcollid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldSelect),
            "::",
            stringify!(resultcollid)
        )
    );
}
impl Default for FieldSelect {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " FieldStore"]
#[doc = ""]
#[doc = " FieldStore represents the operation of modifying one field in a tuple"]
#[doc = " value, yielding a new tuple value (the input is not touched!).  Like"]
#[doc = " the assign case of SubscriptingRef, this is used to implement UPDATE of a"]
#[doc = " portion of a column."]
#[doc = ""]
#[doc = " resulttype is always a named composite type (not a domain).  To update"]
#[doc = " a composite domain value, apply CoerceToDomain to the FieldStore."]
#[doc = ""]
#[doc = " A single FieldStore can actually represent updates of several different"]
#[doc = " fields.  The parser only generates FieldStores with singleelement lists,"]
#[doc = " but the planner will collapse multiple updates of the same base column"]
#[doc = " into one FieldStore."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct FieldStore {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input tuple value"]
    pub newvals: *mut List,
    #[doc = " new value(s) for field(s)"]
    pub fieldnums: *mut List,
    #[doc = " integer list of field attnums"]
    pub resulttype: Oid,
}
#[test]
fn bindgen_test_layout_FieldStore() {
    assert_eq!(
        ::std::mem::size_of::<FieldStore>(),
        40usize,
        concat!("Size of: ", stringify!(FieldStore))
    );
    assert_eq!(
        ::std::mem::align_of::<FieldStore>(),
        8usize,
        concat!("Alignment of ", stringify!(FieldStore))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldStore>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldStore),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldStore>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldStore),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldStore>())).newvals as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldStore),
            "::",
            stringify!(newvals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldStore>())).fieldnums as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldStore),
            "::",
            stringify!(fieldnums)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FieldStore>())).resulttype as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldStore),
            "::",
            stringify!(resulttype)
        )
    );
}
impl Default for FieldStore {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RelabelType"]
#[doc = ""]
#[doc = " RelabelType represents a \"dummy\" type coercion between two binary"]
#[doc = " compatible datatypes, such as reinterpreting the result of an OID"]
#[doc = " expression as an int4.  It is a noop at runtime; we only need it"]
#[doc = " to provide a place to store the correct type to be attributed to"]
#[doc = " the expression result during type resolution.  (We can't get away"]
#[doc = " with just overwriting the type field of the input expression node,"]
#[doc = " so we need a separate node to show the coercion's result type.)"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RelabelType {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub resulttype: Oid,
    #[doc = " output type of coercion expression"]
    pub resulttypmod: int32,
    #[doc = " output typmod (usually 1)"]
    pub resultcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub relabelformat: CoercionForm,
    #[doc = " how to display this node"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RelabelType() {
    assert_eq!(
        ::std::mem::size_of::<RelabelType>(),
        40usize,
        concat!("Size of: ", stringify!(RelabelType))
    );
    assert_eq!(
        ::std::mem::align_of::<RelabelType>(),
        8usize,
        concat!("Alignment of ", stringify!(RelabelType))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).resulttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).resulttypmod as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(resulttypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).resultcollid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(resultcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).relabelformat as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(relabelformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RelabelType>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RelabelType),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RelabelType {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CoerceViaIO"]
#[doc = ""]
#[doc = " CoerceViaIO represents a type coercion between two types whose textual"]
#[doc = " representations are compatible, implemented by invoking the source type's"]
#[doc = " typoutput function then the destination type's typinput function."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CoerceViaIO {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub resulttype: Oid,
    #[doc = " output type of coercion */"]
    pub resultcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub coerceformat: CoercionForm,
    #[doc = " how to display this node"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CoerceViaIO() {
    assert_eq!(
        ::std::mem::size_of::<CoerceViaIO>(),
        32usize,
        concat!("Size of: ", stringify!(CoerceViaIO))
    );
    assert_eq!(
        ::std::mem::align_of::<CoerceViaIO>(),
        8usize,
        concat!("Alignment of ", stringify!(CoerceViaIO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).resulttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).resultcollid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(resultcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).coerceformat as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(coerceformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceViaIO>())).location as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceViaIO),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CoerceViaIO {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ArrayCoerceExpr"]
#[doc = ""]
#[doc = " ArrayCoerceExpr represents a type coercion from one array type to another,"]
#[doc = " which is implemented by applying the perelement coercion expression"]
#[doc = " \"elemexpr\" to each element of the source array.  Within elemexpr, the"]
#[doc = " source element is represented by a CaseTestExpr node.  Note that even if"]
#[doc = " elemexpr is a noop (that is, just CaseTestExpr + RelabelType), the"]
#[doc = " coercion still requires some effort: we have to fix the element type OID"]
#[doc = " stored in the array header."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ArrayCoerceExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression (yields an array)"]
    pub elemexpr: *mut Expr,
    #[doc = " expression representing perelement work"]
    pub resulttype: Oid,
    #[doc = " output type of coercion (an array type)"]
    pub resulttypmod: int32,
    #[doc = " output typmod (also element typmod)"]
    pub resultcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub coerceformat: CoercionForm,
    #[doc = " how to display this node"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ArrayCoerceExpr() {
    assert_eq!(
        ::std::mem::size_of::<ArrayCoerceExpr>(),
        48usize,
        concat!("Size of: ", stringify!(ArrayCoerceExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<ArrayCoerceExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(ArrayCoerceExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).elemexpr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(elemexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).resulttype as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).resulttypmod as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(resulttypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).resultcollid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(resultcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).coerceformat as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(coerceformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayCoerceExpr>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayCoerceExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ArrayCoerceExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ConvertRowtypeExpr"]
#[doc = ""]
#[doc = " ConvertRowtypeExpr represents a type coercion from one composite type"]
#[doc = " to another, where the source type is guaranteed to contain all the columns"]
#[doc = " needed for the destination type plus possibly others; the columns need not"]
#[doc = " be in the same positions, but are matched up by name.  This is primarily"]
#[doc = " used to convert a wholerow value of an inheritance child table into a"]
#[doc = " valid wholerow value of its parent table's rowtype.  Both resulttype"]
#[doc = " and the exposed type of \"arg\" must be named composite types (not domains)."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ConvertRowtypeExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub resulttype: Oid,
    #[doc = " output type (always a composite type) */"]
    pub convertformat: CoercionForm,
    #[doc = " how to display this node"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ConvertRowtypeExpr() {
    assert_eq!(
        ::std::mem::size_of::<ConvertRowtypeExpr>(),
        32usize,
        concat!("Size of: ", stringify!(ConvertRowtypeExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<ConvertRowtypeExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(ConvertRowtypeExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConvertRowtypeExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConvertRowtypeExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConvertRowtypeExpr>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConvertRowtypeExpr),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConvertRowtypeExpr>())).resulttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConvertRowtypeExpr),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConvertRowtypeExpr>())).convertformat as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ConvertRowtypeExpr),
            "::",
            stringify!(convertformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConvertRowtypeExpr>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ConvertRowtypeExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ConvertRowtypeExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CollateExpr  COLLATE"]
#[doc = ""]
#[doc = " The planner replaces CollateExpr with RelabelType during expression"]
#[doc = " preprocessing, so execution never sees a CollateExpr."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CollateExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub collOid: Oid,
    #[doc = " collation's OID"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CollateExpr() {
    assert_eq!(
        ::std::mem::size_of::<CollateExpr>(),
        24usize,
        concat!("Size of: ", stringify!(CollateExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<CollateExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(CollateExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateExpr>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateExpr),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateExpr>())).collOid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateExpr),
            "::",
            stringify!(collOid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateExpr>())).location as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CollateExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CaseExpr  a CASE expression"]
#[doc = ""]
#[doc = " We support two distinct forms of CASE expression:"]
#[doc = "    CASE WHEN boolexpr THEN expr [ WHEN boolexpr THEN expr ... ]"]
#[doc = "    CASE testexpr WHEN compexpr THEN expr [ WHEN compexpr THEN expr ... ]"]
#[doc = " These are distinguishable by the \"arg\" field being NULL in the first case"]
#[doc = " and the testexpr in the second case."]
#[doc = ""]
#[doc = " In the raw grammar output for the second form, the condition expressions"]
#[doc = " of the WHEN clauses are just the comparison values.  Parse analysis"]
#[doc = " converts these to valid boolean expressions of the form"]
#[doc = "    CaseTestExpr '=' compexpr"]
#[doc = " where the CaseTestExpr node is a placeholder that emits the correct"]
#[doc = " value at runtime.  This structure is used so that the testexpr need be"]
#[doc = " evaluated only once.  Note that after parse analysis, the condition"]
#[doc = " expressions always yield boolean."]
#[doc = ""]
#[doc = " Note: we can test whether a CaseExpr has been through parse analysis"]
#[doc = " yet by checking whether casetype is InvalidOid or not."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CaseExpr {
    pub xpr: Expr,
    pub casetype: Oid,
    #[doc = " type of expression result"]
    pub casecollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub arg: *mut Expr,
    #[doc = " implicit equality comparison argument"]
    pub args: *mut List,
    #[doc = " the arguments (list of WHEN clauses)"]
    pub defresult: *mut Expr,
    #[doc = " the default result (ELSE clause)"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CaseExpr() {
    assert_eq!(
        ::std::mem::size_of::<CaseExpr>(),
        48usize,
        concat!("Size of: ", stringify!(CaseExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<CaseExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(CaseExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).casetype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(casetype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).casecollid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(casecollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).arg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).defresult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(defresult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseExpr>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CaseExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CaseWhen  one arm of a CASE expression"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CaseWhen {
    pub xpr: Expr,
    pub expr: *mut Expr,
    #[doc = " condition expression"]
    pub result: *mut Expr,
    #[doc = " substitution result"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CaseWhen() {
    assert_eq!(
        ::std::mem::size_of::<CaseWhen>(),
        32usize,
        concat!("Size of: ", stringify!(CaseWhen))
    );
    assert_eq!(
        ::std::mem::align_of::<CaseWhen>(),
        8usize,
        concat!("Alignment of ", stringify!(CaseWhen))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseWhen>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseWhen),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseWhen>())).expr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseWhen),
            "::",
            stringify!(expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseWhen>())).result as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseWhen),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseWhen>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseWhen),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CaseWhen {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Placeholder node for the test value to be processed by a CASE expression."]
#[doc = " This is effectively like a Param, but can be implemented more simply"]
#[doc = " since we need only one replacement value at a time."]
#[doc = ""]
#[doc = " We also abuse this node type for some other purposes, including:"]
#[doc = " * Placeholder for the current array element value in ArrayCoerceExpr;"]
#[doc = "   see build_coercion_expression()."]
#[doc = " * Nested FieldStore/SubscriptingRef assignment expressions in INSERT/UPDATE;"]
#[doc = "   see transformAssignmentIndirection()."]
#[doc = ""]
#[doc = " The uses in CaseExpr and ArrayCoerceExpr are safe only to the extent that"]
#[doc = " there is not any other CaseExpr or ArrayCoerceExpr between the value source"]
#[doc = " node and its child CaseTestExpr(s).  This is true in the parse analysis"]
#[doc = " output, but the planner's functioninlining logic has to be careful not to"]
#[doc = " break it."]
#[doc = ""]
#[doc = " The nestedassignmentexpression case is safe because the only node types"]
#[doc = " that can be above such CaseTestExprs are FieldStore and SubscriptingRef."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CaseTestExpr {
    pub xpr: Expr,
    pub typeId: Oid,
    #[doc = " type for substituted value"]
    pub typeMod: int32,
    #[doc = " typemod for substituted value"]
    pub collation: Oid,
}
#[test]
fn bindgen_test_layout_CaseTestExpr() {
    assert_eq!(
        ::std::mem::size_of::<CaseTestExpr>(),
        16usize,
        concat!("Size of: ", stringify!(CaseTestExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<CaseTestExpr>(),
        4usize,
        concat!("Alignment of ", stringify!(CaseTestExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseTestExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseTestExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseTestExpr>())).typeId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseTestExpr),
            "::",
            stringify!(typeId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseTestExpr>())).typeMod as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseTestExpr),
            "::",
            stringify!(typeMod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CaseTestExpr>())).collation as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CaseTestExpr),
            "::",
            stringify!(collation)
        )
    );
}
impl Default for CaseTestExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ArrayExpr  an ARRAY[] expression"]
#[doc = ""]
#[doc = " Note: if multidims is false, the constituent expressions all yield the"]
#[doc = " scalar type identified by element_typeid.  If multidims is true, the"]
#[doc = " constituent expressions all yield arrays of element_typeid (ie, the same"]
#[doc = " type as array_typeid); at runtime we must check for compatible subscripts."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ArrayExpr {
    pub xpr: Expr,
    pub array_typeid: Oid,
    #[doc = " type of expression result"]
    pub array_collid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub element_typeid: Oid,
    #[doc = " common type of array elements"]
    pub elements: *mut List,
    #[doc = " the array elements or subarrays"]
    pub multidims: bool,
    #[doc = " true if elements are subarrays"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ArrayExpr() {
    assert_eq!(
        ::std::mem::size_of::<ArrayExpr>(),
        32usize,
        concat!("Size of: ", stringify!(ArrayExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<ArrayExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(ArrayExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).array_typeid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(array_typeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).array_collid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(array_collid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).element_typeid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(element_typeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).elements as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).multidims as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(multidims)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArrayExpr>())).location as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ArrayExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ArrayExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RowExpr  a ROW() expression"]
#[doc = ""]
#[doc = " Note: the list of fields must have a oneforone correspondence with"]
#[doc = " physical fields of the associated rowtype, although it is okay for it"]
#[doc = " to be shorter than the rowtype.  That is, the N'th list element must"]
#[doc = " match up with the N'th physical field.  When the N'th physical field"]
#[doc = " is a dropped column (attisdropped) then the N'th list element can just"]
#[doc = " be a NULL constant.  (This case can only occur for named composite types,"]
#[doc = " not RECORD types, since those are built from the RowExpr itself rather"]
#[doc = " than vice versa.)  It is important not to assume that length(args) is"]
#[doc = " the same as the number of columns logically present in the rowtype."]
#[doc = ""]
#[doc = " colnames provides field names in cases where the names can't easily be"]
#[doc = " obtained otherwise.  Names *must* be provided if row_typeid is RECORDOID."]
#[doc = " If row_typeid identifies a known composite type, colnames can be NIL to"]
#[doc = " indicate the type's cataloged field names apply.  Note that colnames can"]
#[doc = " be nonNIL even for a composite type, and typically is when the RowExpr"]
#[doc = " was created by expanding a wholerow Var.  This is so that we can retain"]
#[doc = " the column alias names of the RTE that the Var referenced (which would"]
#[doc = " otherwise be very difficult to extract from the parsetree).  Like the"]
#[doc = " args list, colnames is oneforone with physical fields of the rowtype."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RowExpr {
    pub xpr: Expr,
    pub args: *mut List,
    #[doc = " the fields"]
    pub row_typeid: Oid,
    #[doc = " row_typeid cannot be a domain over composite, only plain composite.  To"]
    #[doc = " create a composite domain value, apply CoerceToDomain to the RowExpr."]
    #[doc = ""]
    #[doc = " Note: we deliberately do NOT store a typmod.  Although a typmod will be"]
    #[doc = " associated with specific RECORD types at runtime, it will differ for"]
    #[doc = " different backends, and so cannot safely be stored in stored"]
    #[doc = " parsetrees.  We must assume typmod 1 for a RowExpr node."]
    #[doc = ""]
    #[doc = " We don't need to store a collation either.  The result type is"]
    #[doc = " necessarily composite, and composite types never have a collation."]
    pub row_format: CoercionForm,
    #[doc = " how to display this node"]
    pub colnames: *mut List,
    #[doc = " list of String, or NIL"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RowExpr() {
    assert_eq!(
        ::std::mem::size_of::<RowExpr>(),
        40usize,
        concat!("Size of: ", stringify!(RowExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<RowExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(RowExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).args as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).row_typeid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(row_typeid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).row_format as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(row_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).colnames as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(colnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowExpr>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RowExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RowExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " RowCompareExpr  rowwise comparison, such as (a, b) <= (1, 2)"]
#[doc = ""]
#[doc = " We support row comparison for any operator that can be determined to"]
#[doc = " act like =, <>, <, <=, >, or >= (we determine this by looking for the"]
#[doc = " operator in btree opfamilies).  Note that the same operator name might"]
#[doc = " map to a different operator for each pair of row elements, since the"]
#[doc = " element datatypes can vary."]
#[doc = ""]
#[doc = " A RowCompareExpr node is only generated for the < <= > >= cases;"]
#[doc = " the = and <> cases are translated to simple AND or OR combinations"]
#[doc = " of the pairwise comparisons.  However, we include = and <> in the"]
#[doc = " RowCompareType enum for the convenience of parser logic."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum RowCompareType {
    #[doc = " Values of this enum are chosen to match btree strategy numbers"]
    ROWCOMPARE_LT = 1,
    #[doc = " BTLessStrategyNumber"]
    ROWCOMPARE_LE = 2,
    #[doc = " BTLessEqualStrategyNumber"]
    ROWCOMPARE_EQ = 3,
    #[doc = " BTEqualStrategyNumber"]
    ROWCOMPARE_GE = 4,
    #[doc = " BTGreaterEqualStrategyNumber"]
    ROWCOMPARE_GT = 5,
    #[doc = " BTGreaterStrategyNumber"]
    ROWCOMPARE_NE = 6,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RowCompareExpr {
    pub xpr: Expr,
    pub rctype: RowCompareType,
    #[doc = " LT LE GE or GT, never EQ or NE"]
    pub opnos: *mut List,
    #[doc = " OID list of pairwise comparison ops"]
    pub opfamilies: *mut List,
    #[doc = " OID list of containing operator families"]
    pub inputcollids: *mut List,
    #[doc = " OID list of collations for comparisons"]
    pub largs: *mut List,
    #[doc = " the lefthand input arguments"]
    pub rargs: *mut List,
}
#[test]
fn bindgen_test_layout_RowCompareExpr() {
    assert_eq!(
        ::std::mem::size_of::<RowCompareExpr>(),
        48usize,
        concat!("Size of: ", stringify!(RowCompareExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<RowCompareExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(RowCompareExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).rctype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(rctype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).opnos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(opnos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).opfamilies as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(opfamilies)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).inputcollids as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(inputcollids)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).largs as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(largs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RowCompareExpr>())).rargs as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RowCompareExpr),
            "::",
            stringify!(rargs)
        )
    );
}
impl Default for RowCompareExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CoalesceExpr  a COALESCE expression"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CoalesceExpr {
    pub xpr: Expr,
    pub coalescetype: Oid,
    #[doc = " type of expression result"]
    pub coalescecollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub args: *mut List,
    #[doc = " the arguments"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CoalesceExpr() {
    assert_eq!(
        ::std::mem::size_of::<CoalesceExpr>(),
        32usize,
        concat!("Size of: ", stringify!(CoalesceExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<CoalesceExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(CoalesceExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoalesceExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoalesceExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoalesceExpr>())).coalescetype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoalesceExpr),
            "::",
            stringify!(coalescetype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoalesceExpr>())).coalescecollid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoalesceExpr),
            "::",
            stringify!(coalescecollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoalesceExpr>())).args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CoalesceExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoalesceExpr>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CoalesceExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CoalesceExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " MinMaxExpr  a GREATEST or LEAST function"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum MinMaxOp {
    IS_GREATEST = 0,
    IS_LEAST = 1,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct MinMaxExpr {
    pub xpr: Expr,
    pub minmaxtype: Oid,
    #[doc = " common type of arguments and result"]
    pub minmaxcollid: Oid,
    #[doc = " OID of collation of result"]
    pub inputcollid: Oid,
    #[doc = " OID of collation that function should use"]
    pub op: MinMaxOp,
    #[doc = " function to execute"]
    pub args: *mut List,
    #[doc = " the arguments"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MinMaxExpr() {
    assert_eq!(
        ::std::mem::size_of::<MinMaxExpr>(),
        40usize,
        concat!("Size of: ", stringify!(MinMaxExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<MinMaxExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(MinMaxExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).minmaxtype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(minmaxtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).minmaxcollid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(minmaxcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).inputcollid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(inputcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).op as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MinMaxExpr>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MinMaxExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for MinMaxExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " SQLValueFunction  parameterless functions with special grammar productions"]
#[doc = ""]
#[doc = " The SQL standard categorizes some of these as <datetime value function>"]
#[doc = " and others as <general value specification>.  We call 'em SQLValueFunctions"]
#[doc = " for lack of a better term.  We store type and typmod of the result so that"]
#[doc = " some code doesn't need to know each function individually, and because"]
#[doc = " we would need to store typmod anyway for some of the datetime functions."]
#[doc = " Note that currently, all variants return noncollating datatypes, so we do"]
#[doc = " not need a collation field; also, all these functions are stable."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SQLValueFunctionOp {
    SVFOP_CURRENT_DATE = 0,
    SVFOP_CURRENT_TIME = 1,
    SVFOP_CURRENT_TIME_N = 2,
    SVFOP_CURRENT_TIMESTAMP = 3,
    SVFOP_CURRENT_TIMESTAMP_N = 4,
    SVFOP_LOCALTIME = 5,
    SVFOP_LOCALTIME_N = 6,
    SVFOP_LOCALTIMESTAMP = 7,
    SVFOP_LOCALTIMESTAMP_N = 8,
    SVFOP_CURRENT_ROLE = 9,
    SVFOP_CURRENT_USER = 10,
    SVFOP_USER = 11,
    SVFOP_SESSION_USER = 12,
    SVFOP_CURRENT_CATALOG = 13,
    SVFOP_CURRENT_SCHEMA = 14,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct SQLValueFunction {
    pub xpr: Expr,
    pub op: SQLValueFunctionOp,
    #[doc = " which function this is"]
    pub type_: Oid,
    #[doc = " result type/typmod"]
    pub typmod: int32,
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SQLValueFunction() {
    assert_eq!(
        ::std::mem::size_of::<SQLValueFunction>(),
        20usize,
        concat!("Size of: ", stringify!(SQLValueFunction))
    );
    assert_eq!(
        ::std::mem::align_of::<SQLValueFunction>(),
        4usize,
        concat!("Alignment of ", stringify!(SQLValueFunction))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SQLValueFunction>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SQLValueFunction),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SQLValueFunction>())).op as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SQLValueFunction),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SQLValueFunction>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SQLValueFunction),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SQLValueFunction>())).typmod as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SQLValueFunction),
            "::",
            stringify!(typmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SQLValueFunction>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SQLValueFunction),
            "::",
            stringify!(location)
        )
    );
}
impl Default for SQLValueFunction {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " XmlExpr  various SQL/XML functions requiring special grammar productions"]
#[doc = ""]
#[doc = " 'name' carries the \"NAME foo\" argument (already XMLescaped)."]
#[doc = " 'named_args' and 'arg_names' represent an xml_attribute list."]
#[doc = " 'args' carries all other arguments."]
#[doc = ""]
#[doc = " Note: result type/typmod/collation are not stored, but can be deduced"]
#[doc = " from the XmlExprOp.  The type/typmod fields are just used for display"]
#[doc = " purposes, and are NOT necessarily the true result type of the node."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum XmlExprOp {
    IS_XMLCONCAT = 0,
    #[doc = " XMLCONCAT(args)"]
    IS_XMLELEMENT = 1,
    #[doc = " XMLELEMENT(name, xml_attributes, args)"]
    IS_XMLFOREST = 2,
    #[doc = " XMLFOREST(xml_attributes)"]
    IS_XMLPARSE = 3,
    #[doc = " XMLPARSE(text, is_doc, preserve_ws)"]
    IS_XMLPI = 4,
    #[doc = " XMLPI(name [, args])"]
    IS_XMLROOT = 5,
    #[doc = " XMLROOT(xml, version, standalone)"]
    IS_XMLSERIALIZE = 6,
    #[doc = " XMLSERIALIZE(is_document, xmlval)"]
    IS_DOCUMENT = 7,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum XmlOptionType {
    XMLOPTION_DOCUMENT = 0,
    XMLOPTION_CONTENT = 1,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct XmlExpr {
    pub xpr: Expr,
    pub op: XmlExprOp,
    #[doc = " xml function ID"]
    pub name: *mut ::std::os::raw::c_char,
    #[doc = " name in xml(NAME foo ...) syntaxes"]
    pub named_args: *mut List,
    #[doc = " nonXML expressions for xml_attributes"]
    pub arg_names: *mut List,
    #[doc = " parallel list of Value strings"]
    pub args: *mut List,
    #[doc = " list of expressions"]
    pub xmloption: XmlOptionType,
    #[doc = " DOCUMENT or CONTENT"]
    pub type_: Oid,
    #[doc = " target type/typmod for XMLSERIALIZE"]
    pub typmod: int32,
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_XmlExpr() {
    assert_eq!(
        ::std::mem::size_of::<XmlExpr>(),
        56usize,
        concat!("Size of: ", stringify!(XmlExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<XmlExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(XmlExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).op as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).named_args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(named_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).arg_names as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(arg_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).args as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).xmloption as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(xmloption)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).type_ as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).typmod as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(typmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XmlExpr>())).location as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(XmlExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for XmlExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " NullTest"]
#[doc = ""]
#[doc = " NullTest represents the operation of testing a value for NULLness."]
#[doc = " The appropriate test is performed and returned as a boolean Datum."]
#[doc = ""]
#[doc = " When argisrow is false, this simply represents a test for the null value."]
#[doc = ""]
#[doc = " When argisrow is true, the input expression must yield a rowtype, and"]
#[doc = " the node implements \"row IS [NOT] NULL\" per the SQL standard.  This"]
#[doc = " includes checking individual fields for NULLness when the row datum"]
#[doc = " itself isn't NULL."]
#[doc = ""]
#[doc = " NOTE: the combination of a rowtype input and argisrow==false does NOT"]
#[doc = " correspond to the SQL notation \"row IS [NOT] NULL\"; instead, this case"]
#[doc = " represents the SQL notation \"row IS [NOT] DISTINCT FROM NULL\"."]
#[doc = ""]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NullTestType {
    IS_NULL = 0,
    IS_NOT_NULL = 1,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct NullTest {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub nulltesttype: NullTestType,
    #[doc = " IS NULL, IS NOT NULL"]
    pub argisrow: bool,
    #[doc = " T to perform fieldbyfield null checks"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NullTest() {
    assert_eq!(
        ::std::mem::size_of::<NullTest>(),
        32usize,
        concat!("Size of: ", stringify!(NullTest))
    );
    assert_eq!(
        ::std::mem::align_of::<NullTest>(),
        8usize,
        concat!("Alignment of ", stringify!(NullTest))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NullTest>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NullTest),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NullTest>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NullTest),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NullTest>())).nulltesttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NullTest),
            "::",
            stringify!(nulltesttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NullTest>())).argisrow as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NullTest),
            "::",
            stringify!(argisrow)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NullTest>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NullTest),
            "::",
            stringify!(location)
        )
    );
}
impl Default for NullTest {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " BooleanTest"]
#[doc = ""]
#[doc = " BooleanTest represents the operation of determining whether a boolean"]
#[doc = " is TRUE, FALSE, or UNKNOWN (ie, NULL).  All six meaningful combinations"]
#[doc = " are supported.  Note that a NULL input does *not* cause a NULL result."]
#[doc = " The appropriate test is performed and returned as a boolean Datum."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum BoolTestType {
    IS_TRUE = 0,
    IS_NOT_TRUE = 1,
    IS_FALSE = 2,
    IS_NOT_FALSE = 3,
    IS_UNKNOWN = 4,
    IS_NOT_UNKNOWN = 5,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct BooleanTest {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub booltesttype: BoolTestType,
    #[doc = " test type"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_BooleanTest() {
    assert_eq!(
        ::std::mem::size_of::<BooleanTest>(),
        24usize,
        concat!("Size of: ", stringify!(BooleanTest))
    );
    assert_eq!(
        ::std::mem::align_of::<BooleanTest>(),
        8usize,
        concat!("Alignment of ", stringify!(BooleanTest))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BooleanTest>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BooleanTest),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BooleanTest>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BooleanTest),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BooleanTest>())).booltesttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BooleanTest),
            "::",
            stringify!(booltesttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BooleanTest>())).location as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BooleanTest),
            "::",
            stringify!(location)
        )
    );
}
impl Default for BooleanTest {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CoerceToDomain"]
#[doc = ""]
#[doc = " CoerceToDomain represents the operation of coercing a value to a domain"]
#[doc = " type.  At runtime (and not before) the precise set of constraints to be"]
#[doc = " checked will be determined.  If the value passes, it is returned as the"]
#[doc = " result; if not, an error is raised.  Note that this is equivalent to"]
#[doc = " RelabelType in the scenario where no constraints are applied."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CoerceToDomain {
    pub xpr: Expr,
    pub arg: *mut Expr,
    #[doc = " input expression"]
    pub resulttype: Oid,
    #[doc = " domain type ID (result type)"]
    pub resulttypmod: int32,
    #[doc = " output typmod (currently always 1)"]
    pub resultcollid: Oid,
    #[doc = " OID of collation, or InvalidOid if none"]
    pub coercionformat: CoercionForm,
    #[doc = " how to display this node"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CoerceToDomain() {
    assert_eq!(
        ::std::mem::size_of::<CoerceToDomain>(),
        40usize,
        concat!("Size of: ", stringify!(CoerceToDomain))
    );
    assert_eq!(
        ::std::mem::align_of::<CoerceToDomain>(),
        8usize,
        concat!("Alignment of ", stringify!(CoerceToDomain))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).resulttype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(resulttype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).resulttypmod as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(resulttypmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).resultcollid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(resultcollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).coercionformat as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(coercionformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomain>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomain),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CoerceToDomain {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Placeholder node for the value to be processed by a domain's check"]
#[doc = " constraint.  This is effectively like a Param, but can be implemented more"]
#[doc = " simply since we need only one replacement value at a time."]
#[doc = ""]
#[doc = " Note: the typeId/typeMod/collation will be set from the domain's base type,"]
#[doc = " not the domain itself.  This is because we shouldn't consider the value"]
#[doc = " to be a member of the domain if we haven't yet checked its constraints."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CoerceToDomainValue {
    pub xpr: Expr,
    pub typeId: Oid,
    #[doc = " type for substituted value"]
    pub typeMod: int32,
    #[doc = " typemod for substituted value"]
    pub collation: Oid,
    #[doc = " collation for the substituted value"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CoerceToDomainValue() {
    assert_eq!(
        ::std::mem::size_of::<CoerceToDomainValue>(),
        20usize,
        concat!("Size of: ", stringify!(CoerceToDomainValue))
    );
    assert_eq!(
        ::std::mem::align_of::<CoerceToDomainValue>(),
        4usize,
        concat!("Alignment of ", stringify!(CoerceToDomainValue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomainValue>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomainValue),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomainValue>())).typeId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomainValue),
            "::",
            stringify!(typeId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomainValue>())).typeMod as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomainValue),
            "::",
            stringify!(typeMod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomainValue>())).collation as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomainValue),
            "::",
            stringify!(collation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoerceToDomainValue>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CoerceToDomainValue),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CoerceToDomainValue {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Placeholder node for a DEFAULT marker in an INSERT or UPDATE command."]
#[doc = ""]
#[doc = " This is not an executable expression: it must be replaced by the actual"]
#[doc = " column default expression during rewriting.  But it is convenient to"]
#[doc = " treat it as an expression node during parsing and rewriting."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct SetToDefault {
    pub xpr: Expr,
    pub typeId: Oid,
    #[doc = " type for substituted value"]
    pub typeMod: int32,
    #[doc = " typemod for substituted value"]
    pub collation: Oid,
    #[doc = " collation for the substituted value"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SetToDefault() {
    assert_eq!(
        ::std::mem::size_of::<SetToDefault>(),
        20usize,
        concat!("Size of: ", stringify!(SetToDefault))
    );
    assert_eq!(
        ::std::mem::align_of::<SetToDefault>(),
        4usize,
        concat!("Alignment of ", stringify!(SetToDefault))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SetToDefault>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SetToDefault),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SetToDefault>())).typeId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SetToDefault),
            "::",
            stringify!(typeId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SetToDefault>())).typeMod as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SetToDefault),
            "::",
            stringify!(typeMod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SetToDefault>())).collation as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SetToDefault),
            "::",
            stringify!(collation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SetToDefault>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SetToDefault),
            "::",
            stringify!(location)
        )
    );
}
impl Default for SetToDefault {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " Node representing [WHERE] CURRENT OF cursor_name"]
#[doc = ""]
#[doc = " CURRENT OF is a bit like a Var, in that it carries the rangetable index"]
#[doc = " of the target relation being constrained; this aids placing the expression"]
#[doc = " correctly during planning.  We can assume however that its \"levelsup\" is"]
#[doc = " always zero, due to the syntactic constraints on where it can appear."]
#[doc = ""]
#[doc = " The referenced cursor can be represented either as a hardwired string"]
#[doc = " or as a reference to a runtime parameter of type REFCURSOR.  The latter"]
#[doc = " case is for the convenience of plpgsql."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CurrentOfExpr {
    pub xpr: Expr,
    pub cvarno: Index,
    #[doc = " RT index of target relation"]
    pub cursor_name: *mut ::std::os::raw::c_char,
    #[doc = " name of referenced cursor, or NULL"]
    pub cursor_param: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CurrentOfExpr() {
    assert_eq!(
        ::std::mem::size_of::<CurrentOfExpr>(),
        24usize,
        concat!("Size of: ", stringify!(CurrentOfExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<CurrentOfExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(CurrentOfExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CurrentOfExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CurrentOfExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CurrentOfExpr>())).cvarno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CurrentOfExpr),
            "::",
            stringify!(cvarno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CurrentOfExpr>())).cursor_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CurrentOfExpr),
            "::",
            stringify!(cursor_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CurrentOfExpr>())).cursor_param as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CurrentOfExpr),
            "::",
            stringify!(cursor_param)
        )
    );
}
impl Default for CurrentOfExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " NextValueExpr  get next value from sequence"]
#[doc = ""]
#[doc = " This has the same effect as calling the nextval() function, but it does not"]
#[doc = " check permissions on the sequence.  This is used for identity columns,"]
#[doc = " where the sequence is an implicit dependency without its own permissions."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct NextValueExpr {
    pub xpr: Expr,
    pub seqid: Oid,
    pub typeId: Oid,
}
#[test]
fn bindgen_test_layout_NextValueExpr() {
    assert_eq!(
        ::std::mem::size_of::<NextValueExpr>(),
        12usize,
        concat!("Size of: ", stringify!(NextValueExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<NextValueExpr>(),
        4usize,
        concat!("Alignment of ", stringify!(NextValueExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NextValueExpr>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NextValueExpr),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NextValueExpr>())).seqid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NextValueExpr),
            "::",
            stringify!(seqid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<NextValueExpr>())).typeId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NextValueExpr),
            "::",
            stringify!(typeId)
        )
    );
}
impl Default for NextValueExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " InferenceElem  an element of a unique index inference specification"]
#[doc = ""]
#[doc = " This mostly matches the structure of IndexElems, but having a dedicated"]
#[doc = " primnode allows for a clean separation between the use of index parameters"]
#[doc = " by utility commands, and this node."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct InferenceElem {
    pub xpr: Expr,
    pub expr: *mut Node,
    #[doc = " expression to infer from, or NULL"]
    pub infercollid: Oid,
    #[doc = " OID of collation, or InvalidOid"]
    pub inferopclass: Oid,
}
#[test]
fn bindgen_test_layout_InferenceElem() {
    assert_eq!(
        ::std::mem::size_of::<InferenceElem>(),
        24usize,
        concat!("Size of: ", stringify!(InferenceElem))
    );
    assert_eq!(
        ::std::mem::align_of::<InferenceElem>(),
        8usize,
        concat!("Alignment of ", stringify!(InferenceElem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<InferenceElem>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(InferenceElem),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<InferenceElem>())).expr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(InferenceElem),
            "::",
            stringify!(expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<InferenceElem>())).infercollid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(InferenceElem),
            "::",
            stringify!(infercollid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<InferenceElem>())).inferopclass as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(InferenceElem),
            "::",
            stringify!(inferopclass)
        )
    );
}
impl Default for InferenceElem {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " TargetEntry"]
#[doc = "    a target entry (used in query target lists)"]
#[doc = ""]
#[doc = " Strictly speaking, a TargetEntry isn't an expression node (since it can't"]
#[doc = " be evaluated by ExecEvalExpr).  But we treat it as one anyway, since in"]
#[doc = " very many places it's convenient to process a whole query targetlist as a"]
#[doc = " single expression tree."]
#[doc = ""]
#[doc = " In a SELECT's targetlist, resno should always be equal to the item's"]
#[doc = " ordinal position (counting from 1).  However, in an INSERT or UPDATE"]
#[doc = " targetlist, resno represents the attribute number of the destination"]
#[doc = " column for the item; so there may be missing or outoforder resnos."]
#[doc = " It is even legal to have duplicated resnos; consider"]
#[doc = "    UPDATE table SET arraycol[1] = ..., arraycol[2] = ..., ..."]
#[doc = " The two meanings come together in the executor, because the planner"]
#[doc = " transforms INSERT/UPDATE tlists into a normalized form with exactly"]
#[doc = " one entry for each column of the destination table.  Before that's"]
#[doc = " happened, however, it is risky to assume that resno == position."]
#[doc = " Generally get_tle_by_resno() should be used rather than list_nth()"]
#[doc = " to fetch tlist entries by resno, and only in SELECT should you assume"]
#[doc = " that resno is a unique identifier."]
#[doc = ""]
#[doc = " resname is required to represent the correct column name in nonresjunk"]
#[doc = " entries of toplevel SELECT targetlists, since it will be used as the"]
#[doc = " column title sent to the frontend.  In most other contexts it is only"]
#[doc = " a debugging aid, and may be wrong or even NULL.  (In particular, it may"]
#[doc = " be wrong in a tlist from a stored rule, if the referenced column has been"]
#[doc = " renamed by ALTER TABLE since the rule was made.  Also, the planner tends"]
#[doc = " to store NULL rather than look up a valid name for tlist entries in"]
#[doc = " nontoplevel plan nodes.)  In resjunk entries, resname should be either"]
#[doc = " a specific systemgenerated name (such as \"ctid\") or NULL; anything else"]
#[doc = " risks confusing ExecGetJunkAttribute!"]
#[doc = ""]
#[doc = " ressortgroupref is used in the representation of ORDER BY, GROUP BY, and"]
#[doc = " DISTINCT items.  Targetlist entries with ressortgroupref=0 are not"]
#[doc = " sort/group items.  If ressortgroupref>0, then this item is an ORDER BY,"]
#[doc = " GROUP BY, and/or DISTINCT target value.  No two entries in a targetlist"]
#[doc = " may have the same nonzero ressortgroupref  but there is no particular"]
#[doc = " meaning to the nonzero values, except as tags.  (For example, one must"]
#[doc = " not assume that lower ressortgroupref means a more significant sort key.)"]
#[doc = " The order of the associated SortGroupClause lists determine the semantics."]
#[doc = ""]
#[doc = " resorigtbl/resorigcol identify the source of the column, if it is a"]
#[doc = " simple reference to a column of a base table (or view).  If it is not"]
#[doc = " a simple reference, these fields are zeroes."]
#[doc = ""]
#[doc = " If resjunk is true then the column is a working column (such as a sort key)"]
#[doc = " that should be removed from the final output of the query.  Resjunk columns"]
#[doc = " must have resnos that cannot duplicate any regular column's resno.  Also"]
#[doc = " note that there are places that assume resjunk columns come after nonjunk"]
#[doc = " columns."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct TargetEntry {
    pub xpr: Expr,
    pub expr: *mut Expr,
    #[doc = " expression to evaluate"]
    pub resno: AttrNumber,
    #[doc = " attribute number (see notes above)"]
    pub resname: *mut ::std::os::raw::c_char,
    #[doc = " name of the column (could be NULL)"]
    pub ressortgroupref: Index,
    #[doc = " nonzero if referenced by a sort/group"]
    #[doc = " clause"]
    pub resorigtbl: Oid,
    #[doc = " OID of column's source table"]
    pub resorigcol: AttrNumber,
    #[doc = " column's number in source table"]
    pub resjunk: bool,
}
#[test]
fn bindgen_test_layout_TargetEntry() {
    assert_eq!(
        ::std::mem::size_of::<TargetEntry>(),
        48usize,
        concat!("Size of: ", stringify!(TargetEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<TargetEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(TargetEntry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).xpr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(xpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).expr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).resno as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(resno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).resname as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(resname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).ressortgroupref as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(ressortgroupref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).resorigtbl as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(resorigtbl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).resorigcol as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(resorigcol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TargetEntry>())).resjunk as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(TargetEntry),
            "::",
            stringify!(resjunk)
        )
    );
}
impl Default for TargetEntry {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeTblRef  reference to an entry in the query's rangetable"]
#[doc = ""]
#[doc = " We could use direct pointers to the RT entries and skip having these"]
#[doc = " nodes, but multiple pointers to the same node in a querytree cause"]
#[doc = " lots of headaches, so it seems better to store an index into the RT."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeTblRef {
    pub type_: NodeTag,
    pub rtindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RangeTblRef() {
    assert_eq!(
        ::std::mem::size_of::<RangeTblRef>(),
        8usize,
        concat!("Size of: ", stringify!(RangeTblRef))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeTblRef>(),
        4usize,
        concat!("Alignment of ", stringify!(RangeTblRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTblRef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTblRef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTblRef>())).rtindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTblRef),
            "::",
            stringify!(rtindex)
        )
    );
}
impl Default for RangeTblRef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " JoinExpr  for SQL JOIN expressions"]
#[doc = ""]
#[doc = " isNatural, usingClause, and quals are interdependent.  The user can write"]
#[doc = " only one of NATURAL, USING(), or ON() (this is enforced by the grammar)."]
#[doc = " If he writes NATURAL then parse analysis generates the equivalent USING()"]
#[doc = " list, and from that fills in \"quals\" with the right equality comparisons."]
#[doc = " If he writes USING() then \"quals\" is filled with equality comparisons."]
#[doc = " If he writes ON() then only \"quals\" is set.  Note that NATURAL/USING"]
#[doc = " are not equivalent to ON() since they also affect the output column list."]
#[doc = ""]
#[doc = " alias is an Alias node representing the AS aliasclause attached to the"]
#[doc = " join expression, or NULL if no clause.  NB: presence or absence of the"]
#[doc = " alias has a critical impact on semantics, because a join with an alias"]
#[doc = " restricts visibility of the tables/columns inside it."]
#[doc = ""]
#[doc = " During parse analysis, an RTE is created for the Join, and its index"]
#[doc = " is filled into rtindex.  This RTE is present mainly so that Vars can"]
#[doc = " be created that refer to the outputs of the join.  The planner sometimes"]
#[doc = " generates JoinExprs internally; these can have rtindex = 0 if there are"]
#[doc = " no join alias variables referencing such joins."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct JoinExpr {
    pub type_: NodeTag,
    pub jointype: JoinType,
    #[doc = " type of join"]
    pub isNatural: bool,
    #[doc = " Natural join? Will need to shape table"]
    pub larg: *mut Node,
    #[doc = " left subtree"]
    pub rarg: *mut Node,
    #[doc = " right subtree"]
    pub usingClause: *mut List,
    #[doc = " USING clause, if any (list of String)"]
    pub quals: *mut Node,
    #[doc = " qualifiers on join, if any"]
    pub alias: *mut Alias,
    #[doc = " userwritten alias clause, if any"]
    pub rtindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_JoinExpr() {
    assert_eq!(
        ::std::mem::size_of::<JoinExpr>(),
        64usize,
        concat!("Size of: ", stringify!(JoinExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<JoinExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(JoinExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).jointype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(jointype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).isNatural as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(isNatural)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).larg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(larg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).rarg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(rarg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).usingClause as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(usingClause)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).quals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(quals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).alias as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JoinExpr>())).rtindex as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JoinExpr),
            "::",
            stringify!(rtindex)
        )
    );
}
impl Default for JoinExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " FromExpr  represents a FROM ... WHERE ... construct"]
#[doc = ""]
#[doc = " This is both more flexible than a JoinExpr (it can have any number of"]
#[doc = " children, including zero) and less so  we don't need to deal with"]
#[doc = " aliases and so on.  The output column set is implicitly just the union"]
#[doc = " of the outputs of the children."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct FromExpr {
    pub type_: NodeTag,
    pub fromlist: *mut List,
    #[doc = " List of join subtrees"]
    pub quals: *mut Node,
}
#[test]
fn bindgen_test_layout_FromExpr() {
    assert_eq!(
        ::std::mem::size_of::<FromExpr>(),
        24usize,
        concat!("Size of: ", stringify!(FromExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<FromExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(FromExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FromExpr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FromExpr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FromExpr>())).fromlist as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FromExpr),
            "::",
            stringify!(fromlist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FromExpr>())).quals as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FromExpr),
            "::",
            stringify!(quals)
        )
    );
}
impl Default for FromExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " OnConflictExpr  represents an ON CONFLICT DO ... expression"]
#[doc = ""]
#[doc = " The optimizer requires a list of inference elements, and optionally a WHERE"]
#[doc = " clause to infer a unique index.  The unique index (or, occasionally,"]
#[doc = " indexes) inferred are used to arbitrate whether or not the alternative ON"]
#[doc = " CONFLICT path is taken."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct OnConflictExpr {
    pub type_: NodeTag,
    pub action: OnConflictAction,
    #[doc = " Arbiter"]
    pub arbiterElems: *mut List,
    #[doc = " unique index arbiter list (of"]
    #[doc = " InferenceElem's)"]
    pub arbiterWhere: *mut Node,
    #[doc = " unique index arbiter WHERE clause"]
    pub constraint: Oid,
    #[doc = " ON CONFLICT UPDATE"]
    pub onConflictSet: *mut List,
    #[doc = " List of ON CONFLICT SET TargetEntrys"]
    pub onConflictWhere: *mut Node,
    #[doc = " qualifiers to restrict UPDATE to"]
    pub exclRelIndex: ::std::os::raw::c_int,
    #[doc = " RT index of 'excluded' relation"]
    pub exclRelTlist: *mut List,
}
#[test]
fn bindgen_test_layout_OnConflictExpr() {
    assert_eq!(
        ::std::mem::size_of::<OnConflictExpr>(),
        64usize,
        concat!("Size of: ", stringify!(OnConflictExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<OnConflictExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(OnConflictExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).action as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).arbiterElems as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(arbiterElems)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).arbiterWhere as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(arbiterWhere)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).constraint as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(constraint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).onConflictSet as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(onConflictSet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).onConflictWhere as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(onConflictWhere)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).exclRelIndex as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(exclRelIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OnConflictExpr>())).exclRelTlist as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(OnConflictExpr),
            "::",
            stringify!(exclRelTlist)
        )
    );
}
impl Default for OnConflictExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct Value {
    pub type_: NodeTag,
    pub val: Value_ValUnion,
}
#[repr(C)]
pub struct Value_ValUnion {
    pub ival: __BindgenUnionField<::std::os::raw::c_int>,
    pub str: __BindgenUnionField<*mut ::std::os::raw::c_char>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_Value_ValUnion() {
    assert_eq!(
        ::std::mem::size_of::<Value_ValUnion>(),
        8usize,
        concat!("Size of: ", stringify!(Value_ValUnion))
    );
    assert_eq!(
        ::std::mem::align_of::<Value_ValUnion>(),
        8usize,
        concat!("Alignment of ", stringify!(Value_ValUnion))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Value_ValUnion>())).ival as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Value_ValUnion),
            "::",
            stringify!(ival)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Value_ValUnion>())).str as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Value_ValUnion),
            "::",
            stringify!(str)
        )
    );
}
impl Default for Value_ValUnion {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_Value() {
    assert_eq!(
        ::std::mem::size_of::<Value>(),
        16usize,
        concat!("Size of: ", stringify!(Value))
    );
    assert_eq!(
        ::std::mem::align_of::<Value>(),
        8usize,
        concat!("Alignment of ", stringify!(Value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Value>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Value),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Value>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Value),
            "::",
            stringify!(val)
        )
    );
}
impl Default for Value {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum OverridingKind {
    OVERRIDING_NOT_SET = 0,
    OVERRIDING_USER_VALUE = 1,
    OVERRIDING_SYSTEM_VALUE = 2,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " Possible sources of a Query"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum QuerySource {
    QSRC_ORIGINAL = 0,
    #[doc = " original parsetree (explicit query)"]
    QSRC_PARSER = 1,
    #[doc = " added by parse analysis (now unused)"]
    QSRC_INSTEAD_RULE = 2,
    #[doc = " added by unconditional INSTEAD rule"]
    QSRC_QUAL_INSTEAD_RULE = 3,
    #[doc = " added by conditional INSTEAD rule"]
    QSRC_NON_INSTEAD_RULE = 4,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " Sort ordering options for ORDER BY and CREATE INDEX"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SortByDir {
    SORTBY_DEFAULT = 0,
    SORTBY_ASC = 1,
    SORTBY_DESC = 2,
    SORTBY_USING = 3,
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SortByNulls {
    SORTBY_NULLS_DEFAULT = 0,
    SORTBY_NULLS_FIRST = 1,
    SORTBY_NULLS_LAST = 2,
}
#[doc = " TypeName  specifies a type in definitions"]
#[doc = ""]
#[doc = " For TypeName structures generated internally, it is often easier to"]
#[doc = " specify the type by OID than by name.  If \"names\" is NIL then the"]
#[doc = " actual type OID is given by typeOid, otherwise typeOid is unused."]
#[doc = " Similarly, if \"typmods\" is NIL then the actual typmod is expected to"]
#[doc = " be prespecified in typemod, otherwise typemod is unused."]
#[doc = ""]
#[doc = " If pct_type is true, then names is actually a field name and we look up"]
#[doc = " the type of that field.  Otherwise (the normal case), names is a type"]
#[doc = " name possibly qualified with schema and database name."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct TypeName {
    pub type_: NodeTag,
    pub names: *mut List,
    #[doc = " qualified name (list of Value strings)"]
    pub typeOid: Oid,
    #[doc = " type identified by OID"]
    pub setof: bool,
    #[doc = " is a set?"]
    pub pct_type: bool,
    #[doc = " %TYPE specified?"]
    pub typmods: *mut List,
    #[doc = " type modifier expression(s)"]
    pub typemod: int32,
    #[doc = " prespecified type modifier"]
    pub arrayBounds: *mut List,
    #[doc = " array bounds"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TypeName() {
    assert_eq!(
        ::std::mem::size_of::<TypeName>(),
        56usize,
        concat!("Size of: ", stringify!(TypeName))
    );
    assert_eq!(
        ::std::mem::align_of::<TypeName>(),
        8usize,
        concat!("Alignment of ", stringify!(TypeName))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).names as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).typeOid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(typeOid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).setof as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(setof)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).pct_type as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(pct_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).typmods as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(typmods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).typemod as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(typemod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).arrayBounds as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(arrayBounds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeName>())).location as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeName),
            "::",
            stringify!(location)
        )
    );
}
impl Default for TypeName {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ColumnRef  specifies a reference to a column, or possibly a whole tuple"]
#[doc = ""]
#[doc = " The \"fields\" list must be nonempty.  It can contain string Value nodes"]
#[doc = " (representing names) and A_Star nodes (representing occurrence of a '*')."]
#[doc = " Currently, A_Star must appear only as the last list element  the grammar"]
#[doc = " is responsible for enforcing this!"]
#[doc = ""]
#[doc = " Note: any container subscripting or selection of fields from composite columns"]
#[doc = " is represented by an A_Indirection node above the ColumnRef.  However,"]
#[doc = " for simplicity in the normal case, initial field selection from a table"]
#[doc = " name is represented within ColumnRef and not by adding A_Indirection."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ColumnRef {
    pub type_: NodeTag,
    pub fields: *mut List,
    #[doc = " field names (Value strings) or A_Star"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ColumnRef() {
    assert_eq!(
        ::std::mem::size_of::<ColumnRef>(),
        24usize,
        concat!("Size of: ", stringify!(ColumnRef))
    );
    assert_eq!(
        ::std::mem::align_of::<ColumnRef>(),
        8usize,
        concat!("Alignment of ", stringify!(ColumnRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnRef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnRef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnRef>())).fields as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnRef),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnRef>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnRef),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ColumnRef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ParamRef  specifies a $n parameter reference"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ParamRef {
    pub type_: NodeTag,
    pub number: ::std::os::raw::c_int,
    #[doc = " the number of the parameter"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ParamRef() {
    assert_eq!(
        ::std::mem::size_of::<ParamRef>(),
        12usize,
        concat!("Size of: ", stringify!(ParamRef))
    );
    assert_eq!(
        ::std::mem::align_of::<ParamRef>(),
        4usize,
        concat!("Alignment of ", stringify!(ParamRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParamRef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ParamRef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParamRef>())).number as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ParamRef),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ParamRef>())).location as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ParamRef),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ParamRef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " A_Expr  infix, prefix, and postfix expressions"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum A_Expr_Kind {
    AEXPR_OP = 0,
    #[doc = " normal operator"]
    AEXPR_OP_ANY = 1,
    #[doc = " scalar op ANY (array)"]
    AEXPR_OP_ALL = 2,
    #[doc = " scalar op ALL (array)"]
    AEXPR_DISTINCT = 3,
    #[doc = " IS DISTINCT FROM  name must be \"=\""]
    AEXPR_NOT_DISTINCT = 4,
    #[doc = " IS NOT DISTINCT FROM  name must be \"=\""]
    AEXPR_NULLIF = 5,
    #[doc = " NULLIF  name must be \"=\""]
    AEXPR_OF = 6,
    #[doc = " IS [NOT] OF  name must be \"=\" or \"<>\""]
    AEXPR_IN = 7,
    #[doc = " [NOT] IN  name must be \"=\" or \"<>\""]
    AEXPR_LIKE = 8,
    #[doc = " [NOT] LIKE  name must be \"~~\" or \"!~~\""]
    AEXPR_ILIKE = 9,
    #[doc = " [NOT] ILIKE  name must be \"~~*\" or \"!~~*\""]
    AEXPR_SIMILAR = 10,
    #[doc = " [NOT] SIMILAR  name must be \"~\" or \"!~\""]
    AEXPR_BETWEEN = 11,
    #[doc = " name must be \"BETWEEN\""]
    AEXPR_NOT_BETWEEN = 12,
    #[doc = " name must be \"NOT BETWEEN\""]
    AEXPR_BETWEEN_SYM = 13,
    #[doc = " name must be \"BETWEEN SYMMETRIC\""]
    AEXPR_NOT_BETWEEN_SYM = 14,
    #[doc = " name must be \"NOT BETWEEN SYMMETRIC\""]
    AEXPR_PAREN = 15,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct A_Expr {
    pub type_: NodeTag,
    pub kind: A_Expr_Kind,
    #[doc = " see above"]
    pub name: *mut List,
    #[doc = " possiblyqualified name of operator"]
    pub lexpr: *mut Node,
    #[doc = " left argument, or NULL if none"]
    pub rexpr: *mut Node,
    #[doc = " right argument, or NULL if none"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_A_Expr() {
    assert_eq!(
        ::std::mem::size_of::<A_Expr>(),
        40usize,
        concat!("Size of: ", stringify!(A_Expr))
    );
    assert_eq!(
        ::std::mem::align_of::<A_Expr>(),
        8usize,
        concat!("Alignment of ", stringify!(A_Expr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).lexpr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(lexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).rexpr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(rexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Expr>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Expr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for A_Expr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " A_Const  a literal constant"]
#[repr(C)]
pub struct A_Const {
    pub type_: NodeTag,
    pub val: Value,
    #[doc = " value (includes type info, see value.h)"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_A_Const() {
    assert_eq!(
        ::std::mem::size_of::<A_Const>(),
        32usize,
        concat!("Size of: ", stringify!(A_Const))
    );
    assert_eq!(
        ::std::mem::align_of::<A_Const>(),
        8usize,
        concat!("Alignment of ", stringify!(A_Const))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Const>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Const),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Const>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Const),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Const>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Const),
            "::",
            stringify!(location)
        )
    );
}
impl Default for A_Const {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " TypeCast  a CAST expression"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct TypeCast {
    pub type_: NodeTag,
    pub arg: *mut Node,
    #[doc = " the expression being casted"]
    pub typeName: *mut TypeName,
    #[doc = " the target type"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TypeCast() {
    assert_eq!(
        ::std::mem::size_of::<TypeCast>(),
        32usize,
        concat!("Size of: ", stringify!(TypeCast))
    );
    assert_eq!(
        ::std::mem::align_of::<TypeCast>(),
        8usize,
        concat!("Alignment of ", stringify!(TypeCast))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeCast>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeCast),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeCast>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeCast),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeCast>())).typeName as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeCast),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TypeCast>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TypeCast),
            "::",
            stringify!(location)
        )
    );
}
impl Default for TypeCast {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " CollateClause  a COLLATE expression"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct CollateClause {
    pub type_: NodeTag,
    pub arg: *mut Node,
    #[doc = " input expression"]
    pub collname: *mut List,
    #[doc = " possiblyqualified collation name"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CollateClause() {
    assert_eq!(
        ::std::mem::size_of::<CollateClause>(),
        32usize,
        concat!("Size of: ", stringify!(CollateClause))
    );
    assert_eq!(
        ::std::mem::align_of::<CollateClause>(),
        8usize,
        concat!("Alignment of ", stringify!(CollateClause))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateClause>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateClause),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateClause>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateClause),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateClause>())).collname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateClause),
            "::",
            stringify!(collname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollateClause>())).location as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CollateClause),
            "::",
            stringify!(location)
        )
    );
}
impl Default for CollateClause {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " RoleSpec  a role name or one of a few special values."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum RoleSpecType {
    ROLESPEC_CSTRING = 0,
    #[doc = " role name is stored as a C string"]
    ROLESPEC_CURRENT_USER = 1,
    #[doc = " role spec is CURRENT_USER"]
    ROLESPEC_SESSION_USER = 2,
    #[doc = " role spec is SESSION_USER"]
    ROLESPEC_PUBLIC = 3,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RoleSpec {
    pub type_: NodeTag,
    pub roletype: RoleSpecType,
    #[doc = " Type of this rolespec"]
    pub rolename: *mut ::std::os::raw::c_char,
    #[doc = " filled only for ROLESPEC_CSTRING"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RoleSpec() {
    assert_eq!(
        ::std::mem::size_of::<RoleSpec>(),
        24usize,
        concat!("Size of: ", stringify!(RoleSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<RoleSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(RoleSpec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RoleSpec>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RoleSpec),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RoleSpec>())).roletype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RoleSpec),
            "::",
            stringify!(roletype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RoleSpec>())).rolename as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RoleSpec),
            "::",
            stringify!(rolename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RoleSpec>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RoleSpec),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RoleSpec {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " FuncCall  a function or aggregate invocation"]
#[doc = ""]
#[doc = " agg_order (if not NIL) indicates we saw 'foo(... ORDER BY ...)', or if"]
#[doc = " agg_within_group is true, it was 'foo(...) WITHIN GROUP (ORDER BY ...)'."]
#[doc = " agg_star indicates we saw a 'foo(*)' construct, while agg_distinct"]
#[doc = " indicates we saw 'foo(DISTINCT ...)'.  In any of these cases, the"]
#[doc = " construct *must* be an aggregate call.  Otherwise, it might be either an"]
#[doc = " aggregate or some other kind of function.  However, if FILTER or OVER is"]
#[doc = " present it had better be an aggregate or window function."]
#[doc = ""]
#[doc = " Normally, you'd initialize this via makeFuncCall() and then only change the"]
#[doc = " parts of the struct its defaults don't match afterwards, as needed."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct FuncCall {
    pub type_: NodeTag,
    pub funcname: *mut List,
    #[doc = " qualified name of function"]
    pub args: *mut List,
    #[doc = " the arguments (list of exprs)"]
    pub agg_order: *mut List,
    #[doc = " ORDER BY (list of SortBy)"]
    pub agg_filter: *mut Node,
    #[doc = " FILTER clause, if any"]
    pub agg_within_group: bool,
    #[doc = " ORDER BY appeared in WITHIN GROUP"]
    pub agg_star: bool,
    #[doc = " argument was really '*'"]
    pub agg_distinct: bool,
    #[doc = " arguments were labeled DISTINCT"]
    pub func_variadic: bool,
    #[doc = " last argument was labeled VARIADIC"]
    pub over: *mut WindowDef,
    #[doc = " OVER clause, if any"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FuncCall() {
    assert_eq!(
        ::std::mem::size_of::<FuncCall>(),
        64usize,
        concat!("Size of: ", stringify!(FuncCall))
    );
    assert_eq!(
        ::std::mem::align_of::<FuncCall>(),
        8usize,
        concat!("Alignment of ", stringify!(FuncCall))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).funcname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(funcname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).agg_order as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(agg_order)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).agg_filter as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(agg_filter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).agg_within_group as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(agg_within_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).agg_star as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(agg_star)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).agg_distinct as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(agg_distinct)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).func_variadic as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(func_variadic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).over as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(over)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FuncCall>())).location as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FuncCall),
            "::",
            stringify!(location)
        )
    );
}
impl Default for FuncCall {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " A_Star  '*' representing all columns of a table or compound field"]
#[doc = ""]
#[doc = " This can appear within ColumnRef.fields, A_Indirection.indirection, and"]
#[doc = " ResTarget.indirection lists."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct A_Star {
    pub type_: NodeTag,
}
#[test]
fn bindgen_test_layout_A_Star() {
    assert_eq!(
        ::std::mem::size_of::<A_Star>(),
        4usize,
        concat!("Size of: ", stringify!(A_Star))
    );
    assert_eq!(
        ::std::mem::align_of::<A_Star>(),
        4usize,
        concat!("Alignment of ", stringify!(A_Star))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Star>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Star),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for A_Star {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " A_Indices  array subscript or slice bounds ([idx] or [lidx:uidx])"]
#[doc = ""]
#[doc = " In slice case, either or both of lidx and uidx can be NULL (omitted)."]
#[doc = " In nonslice case, uidx holds the single subscript and lidx is always NULL."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct A_Indices {
    pub type_: NodeTag,
    pub is_slice: bool,
    #[doc = " true if slice (i.e., colon present)"]
    pub lidx: *mut Node,
    #[doc = " slice lower bound, if any"]
    pub uidx: *mut Node,
}
#[test]
fn bindgen_test_layout_A_Indices() {
    assert_eq!(
        ::std::mem::size_of::<A_Indices>(),
        24usize,
        concat!("Size of: ", stringify!(A_Indices))
    );
    assert_eq!(
        ::std::mem::align_of::<A_Indices>(),
        8usize,
        concat!("Alignment of ", stringify!(A_Indices))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indices>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indices),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indices>())).is_slice as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indices),
            "::",
            stringify!(is_slice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indices>())).lidx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indices),
            "::",
            stringify!(lidx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indices>())).uidx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indices),
            "::",
            stringify!(uidx)
        )
    );
}
impl Default for A_Indices {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " A_Indirection  select a field and/or array element from an expression"]
#[doc = ""]
#[doc = " The indirection list can contain A_Indices nodes (representing"]
#[doc = " subscripting), string Value nodes (representing field selection  the"]
#[doc = " string value is the name of the field to select), and A_Star nodes"]
#[doc = " (representing selection of all fields of a composite type)."]
#[doc = " For example, a complex selection operation like"]
#[doc = "          (foo).field1[42][7].field2"]
#[doc = " would be represented with a single A_Indirection node having a 4element"]
#[doc = " indirection list."]
#[doc = ""]
#[doc = " Currently, A_Star must appear only as the last list element  the grammar"]
#[doc = " is responsible for enforcing this!"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct A_Indirection {
    pub type_: NodeTag,
    pub arg: *mut Node,
    #[doc = " the thing being selected from"]
    pub indirection: *mut List,
}
#[test]
fn bindgen_test_layout_A_Indirection() {
    assert_eq!(
        ::std::mem::size_of::<A_Indirection>(),
        24usize,
        concat!("Size of: ", stringify!(A_Indirection))
    );
    assert_eq!(
        ::std::mem::align_of::<A_Indirection>(),
        8usize,
        concat!("Alignment of ", stringify!(A_Indirection))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indirection>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indirection),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indirection>())).arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indirection),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_Indirection>())).indirection as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(A_Indirection),
            "::",
            stringify!(indirection)
        )
    );
}
impl Default for A_Indirection {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " A_ArrayExpr  an ARRAY[] construct"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct A_ArrayExpr {
    pub type_: NodeTag,
    pub elements: *mut List,
    #[doc = " array element expressions"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_A_ArrayExpr() {
    assert_eq!(
        ::std::mem::size_of::<A_ArrayExpr>(),
        24usize,
        concat!("Size of: ", stringify!(A_ArrayExpr))
    );
    assert_eq!(
        ::std::mem::align_of::<A_ArrayExpr>(),
        8usize,
        concat!("Alignment of ", stringify!(A_ArrayExpr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_ArrayExpr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(A_ArrayExpr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_ArrayExpr>())).elements as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(A_ArrayExpr),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<A_ArrayExpr>())).location as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(A_ArrayExpr),
            "::",
            stringify!(location)
        )
    );
}
impl Default for A_ArrayExpr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ResTarget"]
#[doc = "   result target (used in target list of pretransformed parse trees)"]
#[doc = ""]
#[doc = " In a SELECT target list, 'name' is the column label from an"]
#[doc = " 'AS ColumnLabel' clause, or NULL if there was none, and 'val' is the"]
#[doc = " value expression itself.  The 'indirection' field is not used."]
#[doc = ""]
#[doc = " INSERT uses ResTarget in its targetcolumnnames list.  Here, 'name' is"]
#[doc = " the name of the destination column, 'indirection' stores any subscripts"]
#[doc = " attached to the destination, and 'val' is not used."]
#[doc = ""]
#[doc = " In an UPDATE target list, 'name' is the name of the destination column,"]
#[doc = " 'indirection' stores any subscripts attached to the destination, and"]
#[doc = " 'val' is the expression to assign."]
#[doc = ""]
#[doc = " See A_Indirection for more info about what can appear in 'indirection'."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ResTarget {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    #[doc = " column name or NULL"]
    pub indirection: *mut List,
    #[doc = " subscripts, field names, and '*', or NIL"]
    pub val: *mut Node,
    #[doc = " the value expression to compute or assign"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ResTarget() {
    assert_eq!(
        ::std::mem::size_of::<ResTarget>(),
        40usize,
        concat!("Size of: ", stringify!(ResTarget))
    );
    assert_eq!(
        ::std::mem::align_of::<ResTarget>(),
        8usize,
        concat!("Alignment of ", stringify!(ResTarget))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ResTarget>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ResTarget),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ResTarget>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ResTarget),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ResTarget>())).indirection as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ResTarget),
            "::",
            stringify!(indirection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ResTarget>())).val as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ResTarget),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ResTarget>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ResTarget),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ResTarget {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " MultiAssignRef  element of a row source expression for UPDATE"]
#[doc = ""]
#[doc = " In an UPDATE target list, when we have SET (a,b,c) = rowvaluedexpression,"]
#[doc = " we generate separate ResTarget items for each of a,b,c.  Their \"val\" trees"]
#[doc = " are MultiAssignRef nodes numbered 1..n, linking to a common copy of the"]
#[doc = " rowvaluedexpression (which parse analysis will process only once, when"]
#[doc = " handling the MultiAssignRef with colno=1)."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct MultiAssignRef {
    pub type_: NodeTag,
    pub source: *mut Node,
    #[doc = " the rowvalued expression"]
    pub colno: ::std::os::raw::c_int,
    #[doc = " column number for this target (1..n)"]
    pub ncolumns: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_MultiAssignRef() {
    assert_eq!(
        ::std::mem::size_of::<MultiAssignRef>(),
        24usize,
        concat!("Size of: ", stringify!(MultiAssignRef))
    );
    assert_eq!(
        ::std::mem::align_of::<MultiAssignRef>(),
        8usize,
        concat!("Alignment of ", stringify!(MultiAssignRef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MultiAssignRef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiAssignRef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MultiAssignRef>())).source as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiAssignRef),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MultiAssignRef>())).colno as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiAssignRef),
            "::",
            stringify!(colno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MultiAssignRef>())).ncolumns as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MultiAssignRef),
            "::",
            stringify!(ncolumns)
        )
    );
}
impl Default for MultiAssignRef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " SortBy  for ORDER BY clause"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct SortBy {
    pub type_: NodeTag,
    pub node: *mut Node,
    #[doc = " expression to sort on"]
    pub sortby_dir: SortByDir,
    #[doc = " ASC/DESC/USING/default"]
    pub sortby_nulls: SortByNulls,
    #[doc = " NULLS FIRST/LAST"]
    pub useOp: *mut List,
    #[doc = " name of op to use, if SORTBY_USING"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SortBy() {
    assert_eq!(
        ::std::mem::size_of::<SortBy>(),
        40usize,
        concat!("Size of: ", stringify!(SortBy))
    );
    assert_eq!(
        ::std::mem::align_of::<SortBy>(),
        8usize,
        concat!("Alignment of ", stringify!(SortBy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).node as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).sortby_dir as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(sortby_dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).sortby_nulls as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(sortby_nulls)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).useOp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(useOp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SortBy>())).location as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SortBy),
            "::",
            stringify!(location)
        )
    );
}
impl Default for SortBy {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " WindowDef  raw representation of WINDOW and OVER clauses"]
#[doc = ""]
#[doc = " For entries in a WINDOW list, \"name\" is the window name being defined."]
#[doc = " For OVER clauses, we use \"name\" for the \"OVER window\" syntax, or \"refname\""]
#[doc = " for the \"OVER (window)\" syntax, which is subtly different  the latter"]
#[doc = " implies overriding the window frame clause."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct WindowDef {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    #[doc = " window's own name"]
    pub refname: *mut ::std::os::raw::c_char,
    #[doc = " referenced window name, if any"]
    pub partitionClause: *mut List,
    #[doc = " PARTITION BY expression list"]
    pub orderClause: *mut List,
    #[doc = " ORDER BY (list of SortBy)"]
    pub frameOptions: ::std::os::raw::c_int,
    #[doc = " frame_clause options, see below"]
    pub startOffset: *mut Node,
    #[doc = " expression for starting bound, if any"]
    pub endOffset: *mut Node,
    #[doc = " expression for ending bound, if any"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_WindowDef() {
    assert_eq!(
        ::std::mem::size_of::<WindowDef>(),
        72usize,
        concat!("Size of: ", stringify!(WindowDef))
    );
    assert_eq!(
        ::std::mem::align_of::<WindowDef>(),
        8usize,
        concat!("Alignment of ", stringify!(WindowDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).refname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(refname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).partitionClause as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(partitionClause)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).orderClause as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(orderClause)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).frameOptions as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(frameOptions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).startOffset as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(startOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).endOffset as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(endOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WindowDef>())).location as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(WindowDef),
            "::",
            stringify!(location)
        )
    );
}
impl Default for WindowDef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeSubselect  subquery appearing in a FROM clause"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeSubselect {
    pub type_: NodeTag,
    pub lateral: bool,
    #[doc = " does it have LATERAL prefix?"]
    pub subquery: *mut Node,
    #[doc = " the untransformed subselect clause"]
    pub alias: *mut Alias,
}
#[test]
fn bindgen_test_layout_RangeSubselect() {
    assert_eq!(
        ::std::mem::size_of::<RangeSubselect>(),
        24usize,
        concat!("Size of: ", stringify!(RangeSubselect))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeSubselect>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeSubselect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeSubselect>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeSubselect),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeSubselect>())).lateral as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeSubselect),
            "::",
            stringify!(lateral)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeSubselect>())).subquery as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeSubselect),
            "::",
            stringify!(subquery)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeSubselect>())).alias as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeSubselect),
            "::",
            stringify!(alias)
        )
    );
}
impl Default for RangeSubselect {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeFunction  function call appearing in a FROM clause"]
#[doc = ""]
#[doc = " functions is a List because we use this to represent the construct"]
#[doc = " ROWS FROM(func1(...), func2(...), ...).  Each element of this list is a"]
#[doc = " twoelement sublist, the first element being the untransformed function"]
#[doc = " call tree, and the second element being a possiblyempty list of ColumnDef"]
#[doc = " nodes representing any columndef list attached to that function within the"]
#[doc = " ROWS FROM() syntax."]
#[doc = ""]
#[doc = " alias and coldeflist represent any alias and/or columndef list attached"]
#[doc = " at the top level.  (We disallow coldeflist appearing both here and"]
#[doc = " perfunction, but that's checked in parse analysis, not by the grammar.)"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeFunction {
    pub type_: NodeTag,
    pub lateral: bool,
    #[doc = " does it have LATERAL prefix?"]
    pub ordinality: bool,
    #[doc = " does it have WITH ORDINALITY suffix?"]
    pub is_rowsfrom: bool,
    #[doc = " is result of ROWS FROM() syntax?"]
    pub functions: *mut List,
    #[doc = " perfunction information, see above"]
    pub alias: *mut Alias,
    #[doc = " table alias & optional column aliases"]
    pub coldeflist: *mut List,
}
#[test]
fn bindgen_test_layout_RangeFunction() {
    assert_eq!(
        ::std::mem::size_of::<RangeFunction>(),
        32usize,
        concat!("Size of: ", stringify!(RangeFunction))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeFunction>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeFunction))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).lateral as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(lateral)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).ordinality as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(ordinality)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).is_rowsfrom as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(is_rowsfrom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).functions as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(functions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).alias as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeFunction>())).coldeflist as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeFunction),
            "::",
            stringify!(coldeflist)
        )
    );
}
impl Default for RangeFunction {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeTableFunc  raw form of \"table functions\" such as XMLTABLE"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeTableFunc {
    pub type_: NodeTag,
    pub lateral: bool,
    #[doc = " does it have LATERAL prefix?"]
    pub docexpr: *mut Node,
    #[doc = " document expression"]
    pub rowexpr: *mut Node,
    #[doc = " row generator expression"]
    pub namespaces: *mut List,
    #[doc = " list of namespaces as ResTarget"]
    pub columns: *mut List,
    #[doc = " list of RangeTableFuncCol"]
    pub alias: *mut Alias,
    #[doc = " table alias & optional column aliases"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RangeTableFunc() {
    assert_eq!(
        ::std::mem::size_of::<RangeTableFunc>(),
        56usize,
        concat!("Size of: ", stringify!(RangeTableFunc))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeTableFunc>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeTableFunc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).lateral as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(lateral)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).docexpr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(docexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).rowexpr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(rowexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).namespaces as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(namespaces)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).columns as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(columns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).alias as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFunc>())).location as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFunc),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RangeTableFunc {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeTableFuncCol  one column in a RangeTableFunc>columns"]
#[doc = ""]
#[doc = " If for_ordinality is true (FOR ORDINALITY), then the column is an int4"]
#[doc = " column and the rest of the fields are ignored."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeTableFuncCol {
    pub type_: NodeTag,
    pub colname: *mut ::std::os::raw::c_char,
    #[doc = " name of generated column"]
    pub typeName: *mut TypeName,
    #[doc = " type of generated column"]
    pub for_ordinality: bool,
    #[doc = " does it have FOR ORDINALITY?"]
    pub is_not_null: bool,
    #[doc = " does it have NOT NULL?"]
    pub colexpr: *mut Node,
    #[doc = " column filter expression"]
    pub coldefexpr: *mut Node,
    #[doc = " column default value expression"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RangeTableFuncCol() {
    assert_eq!(
        ::std::mem::size_of::<RangeTableFuncCol>(),
        56usize,
        concat!("Size of: ", stringify!(RangeTableFuncCol))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeTableFuncCol>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeTableFuncCol))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).colname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(colname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).typeName as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RangeTableFuncCol>())).for_ordinality as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(for_ordinality)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).is_not_null as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(is_not_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).colexpr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(colexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).coldefexpr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(coldefexpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableFuncCol>())).location as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableFuncCol),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RangeTableFuncCol {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " RangeTableSample  TABLESAMPLE appearing in a raw FROM clause"]
#[doc = ""]
#[doc = " This node, appearing only in raw parse trees, represents"]
#[doc = "    <relation> TABLESAMPLE <method> (<params>) REPEATABLE (<num>)"]
#[doc = " Currently, the <relation> can only be a RangeVar, but we might in future"]
#[doc = " allow RangeSubselect and other options.  Note that the RangeTableSample"]
#[doc = " is wrapped around the node representing the <relation>, rather than being"]
#[doc = " a subfield of it."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct RangeTableSample {
    pub type_: NodeTag,
    pub relation: *mut Node,
    #[doc = " relation to be sampled"]
    pub method: *mut List,
    #[doc = " sampling method name (possibly qualified)"]
    pub args: *mut List,
    #[doc = " argument(s) for sampling method"]
    pub repeatable: *mut Node,
    #[doc = " REPEATABLE expression, or NULL if none"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_RangeTableSample() {
    assert_eq!(
        ::std::mem::size_of::<RangeTableSample>(),
        48usize,
        concat!("Size of: ", stringify!(RangeTableSample))
    );
    assert_eq!(
        ::std::mem::align_of::<RangeTableSample>(),
        8usize,
        concat!("Alignment of ", stringify!(RangeTableSample))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).relation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(relation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).method as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).repeatable as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(repeatable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RangeTableSample>())).location as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RangeTableSample),
            "::",
            stringify!(location)
        )
    );
}
impl Default for RangeTableSample {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " ColumnDef  column definition (used in various creates)"]
#[doc = ""]
#[doc = " If the column has a default value, we may have the value expression"]
#[doc = " in either \"raw\" form (an untransformed parse tree) or \"cooked\" form"]
#[doc = " (a postparseanalysis, executable expression tree), depending on"]
#[doc = " how this ColumnDef node was created (by parsing, or by inheritance"]
#[doc = " from an existing relation).  We should never have both in the same node!"]
#[doc = ""]
#[doc = " Similarly, we may have a COLLATE specification in either raw form"]
#[doc = " (represented as a CollateClause with arg==NULL) or cooked form"]
#[doc = " (the collation's OID)."]
#[doc = ""]
#[doc = " The constraints list may contain a CONSTR_DEFAULT item in a raw"]
#[doc = " parsetree produced by gram.y, but transformCreateStmt will remove"]
#[doc = " the item and set raw_default instead.  CONSTR_DEFAULT items"]
#[doc = " should not appear in any subsequent processing."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct ColumnDef {
    pub type_: NodeTag,
    pub colname: *mut ::std::os::raw::c_char,
    #[doc = " name of column"]
    pub typeName: *mut TypeName,
    #[doc = " type of column"]
    pub inhcount: ::std::os::raw::c_int,
    #[doc = " number of times column is inherited"]
    pub is_local: bool,
    #[doc = " column has local (noninherited) def'n"]
    pub is_not_null: bool,
    #[doc = " NOT NULL constraint specified?"]
    pub is_from_type: bool,
    #[doc = " column definition came from table type"]
    pub storage: ::std::os::raw::c_char,
    #[doc = " attstorage setting, or 0 for default"]
    pub raw_default: *mut Node,
    #[doc = " default value (untransformed parse tree)"]
    pub cooked_default: *mut Node,
    #[doc = " default value (transformed expr tree)"]
    pub identity: ::std::os::raw::c_char,
    #[doc = " attidentity setting"]
    pub identitySequence: *mut RangeVar,
    #[doc = " to store identity sequence name for"]
    #[doc = " ALTER TABLE ... ADD COLUMN"]
    pub generated: ::std::os::raw::c_char,
    #[doc = " attgenerated setting"]
    pub collClause: *mut CollateClause,
    #[doc = " untransformed COLLATE spec, if any"]
    pub collOid: Oid,
    #[doc = " collation OID (InvalidOid if not set)"]
    pub constraints: *mut List,
    #[doc = " other constraints on column"]
    pub fdwoptions: *mut List,
    #[doc = " percolumn FDW options"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ColumnDef() {
    assert_eq!(
        ::std::mem::size_of::<ColumnDef>(),
        112usize,
        concat!("Size of: ", stringify!(ColumnDef))
    );
    assert_eq!(
        ::std::mem::align_of::<ColumnDef>(),
        8usize,
        concat!("Alignment of ", stringify!(ColumnDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).colname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(colname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).typeName as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).inhcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(inhcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).is_local as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(is_local)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).is_not_null as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(is_not_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).is_from_type as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(is_from_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).storage as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(storage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).raw_default as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(raw_default)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).cooked_default as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(cooked_default)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).identity as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(identity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).identitySequence as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(identitySequence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).generated as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(generated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).collClause as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(collClause)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).collOid as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(collOid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).constraints as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(constraints)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).fdwoptions as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(fdwoptions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColumnDef>())).location as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ColumnDef),
            "::",
            stringify!(location)
        )
    );
}
impl Default for ColumnDef {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " TableLikeClause  CREATE TABLE ( ... LIKE ... ) clause"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct TableLikeClause {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub options: bits32,
}
#[test]
fn bindgen_test_layout_TableLikeClause() {
    assert_eq!(
        ::std::mem::size_of::<TableLikeClause>(),
        24usize,
        concat!("Size of: ", stringify!(TableLikeClause))
    );
    assert_eq!(
        ::std::mem::align_of::<TableLikeClause>(),
        8usize,
        concat!("Alignment of ", stringify!(TableLikeClause))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableLikeClause>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TableLikeClause),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableLikeClause>())).relation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TableLikeClause),
            "::",
            stringify!(relation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TableLikeClause>())).options as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TableLikeClause),
            "::",
            stringify!(options)
        )
    );
}
impl Default for TableLikeClause {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum TableLikeOption {
    CREATE_TABLE_LIKE_COMMENTS = 1,
    CREATE_TABLE_LIKE_CONSTRAINTS = 2,
    CREATE_TABLE_LIKE_DEFAULTS = 4,
    CREATE_TABLE_LIKE_GENERATED = 8,
    CREATE_TABLE_LIKE_IDENTITY = 16,
    CREATE_TABLE_LIKE_INDEXES = 32,
    CREATE_TABLE_LIKE_STATISTICS = 64,
    CREATE_TABLE_LIKE_STORAGE = 128,
    CREATE_TABLE_LIKE_ALL = 2147483647,
}
#[doc = " IndexElem  index parameters (used in CREATE INDEX, and in ON CONFLICT)"]
#[doc = ""]
#[doc = " For a plain index attribute, 'name' is the name of the table column to"]
#[doc = " index, and 'expr' is NULL.  For an index expression, 'name' is NULL and"]
#[doc = " 'expr' is the expression tree."]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct IndexElem {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    #[doc = " name of attribute to index, or NULL"]
    pub expr: *mut Node,
    #[doc = " expression to index, or NULL"]
    pub indexcolname: *mut ::std::os::raw::c_char,
    #[doc = " name for index column; NULL = default"]
    pub collation: *mut List,
    #[doc = " name of collation; NIL = default"]
    pub opclass: *mut List,
    #[doc = " name of desired opclass; NIL = default"]
    pub ordering: SortByDir,
    #[doc = " ASC/DESC/default"]
    pub nulls_ordering: SortByNulls,
}
#[test]
fn bindgen_test_layout_IndexElem() {
    assert_eq!(
        ::std::mem::size_of::<IndexElem>(),
        56usize,
        concat!("Size of: ", stringify!(IndexElem))
    );
    assert_eq!(
        ::std::mem::align_of::<IndexElem>(),
        8usize,
        concat!("Alignment of ", stringify!(IndexElem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).expr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).indexcolname as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(indexcolname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).collation as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(collation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).opclass as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(opclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).ordering as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(ordering)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IndexElem>())).nulls_ordering as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(IndexElem),
            "::",
            stringify!(nulls_ordering)
        )
    );
}
impl Default for IndexElem {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[derive(Serialize, Deserialize)]
#[repr(u32)]
#[doc = " DefElem  a generic \"name = value\" option definition"]
#[doc = ""]
#[doc = " In some contexts the name can be qualified.  Also, certain SQL commands"]
#[doc = " allow a SET/ADD/DROP action to be attached to option settings, so it's"]
#[doc = " convenient to carry a field for that too.  (Note: currently, it is our"]
#[doc = " practice that the grammar allows namespace and action only in statements"]
#[doc = " where they are relevant; C code can just ignore those fields in other"]
#[doc = " statements.)"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum DefElemAction {
    DEFELEM_UNSPEC = 0,
    #[doc = " no action given"]
    DEFELEM_SET = 1,
    #[doc = " no action given"]
    DEFELEM_ADD = 2,
    #[doc = " no action given"]
    DEFELEM_DROP = 3,
}
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct DefElem {
    pub type_: NodeTag,
    pub defnamespace: *mut ::std::os::raw::c_char,
    #[doc = " NULL if unqualified name"]
    pub defname: *mut ::std::os::raw::c_char,
    pub arg: *mut Node,
    #[doc = " a (Value *) or a (TypeName *)"]
    pub defaction: DefElemAction,
    #[doc = " unspecified action, or SET/ADD/DROP"]
    pub location: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DefElem() {
    assert_eq!(
        ::std::mem::size_of::<DefElem>(),
        40usize,
        concat!("Size of: ", stringify!(DefElem))
    );
    assert_eq!(
        ::std::mem::align_of::<DefElem>(),
        8usize,
        concat!("Alignment of ", stringify!(DefElem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).defnamespace as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(defnamespace)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).defname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(defname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).arg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).defaction as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(defaction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DefElem>())).location as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DefElem),
            "::",
            stringify!(location)
        )
    );
}
impl Default for DefElem {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[doc = " LockingClause  raw representation of FOR [NO KEY] UPDATE/[KEY] SHARE"]
#[doc = "    options"]
#[doc = ""]
#[doc = " Note: lockedRels == NIL means \"all relations in query\".  Otherwise it"]
#[doc = " is a list of RangeVar nodes.  (We use RangeVar mainly because it carries"]
#[doc = " a location field  currently, parse analysis insists on unqualified"]
#[doc = " names in LockingClause.)"]
#[repr(C)]
#[derive(Debug, Hash, PartialEq, Eq)]
pub struct LockingClause {
    pub type_: NodeTag,
    pub lockedRels: *mut List,
    #[doc = " FOR [KEY] UPDATE/SHARE relations"]
    pub strength: LockClauseStrength,
    pub waitPolicy: LockWaitPolicy,
}
#[test]
fn bindgen_test_layout_LockingClause() {
    assert_eq!(
        ::std::mem::size_of::<LockingClause>(),
        24usize,
        concat!("Size of: ", stringify!(LockingClause))
    );
    assert_eq!(
        ::std::mem::align_of::<LockingClause>(),
        8usize,
        concat!("Alignment of ", stringify!(LockingClause))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LockingClause>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LockingClause),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LockingClause>())).lockedRels as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LockingClause),
            "::",
